<?php


$MD = isset($_GET["MD"])?$_GET["MD"] : 'default';
$ad = isset($_GET["ad"])?$_GET["ad"] : '';


$popstate='';
$locationUrl="";
$link_id="";
$post_id="";
$referer = empty($_SERVER['HTTP_REFERER']) ? '' : trim($_SERVER['HTTP_REFERER']);
if ( $MD == "default") {  // 자사 하이애드원

	$popstate='disable';
	$locationUrl="";

    $sCode = "03Kq"; // 트래픽 체크
$pageid1 = "03wK"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "03wW"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "03xp"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "03wh"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "03ws"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "03x3"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "03xa"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "03xp"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "03y0"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "03yB"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "03yM"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "03yX"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "03yj"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "03yu"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "03z6"; // 요일별_하단배너_670X400

//해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xp"; // 요일별_월요일_웹툰_9슬롯_214X200
$weekPageId[2] = "03y0"; // 요일별_화요일_웹툰_9슬롯_214X200
$weekPageId[3] = "03yB"; // 요일별_수요일_웹툰_9슬롯_214X200
$weekPageId[4] = "03yM"; // 요일별_목요일_웹툰_9슬롯_214X200
$weekPageId[5] = "03yX"; // 요일별_금요일_웹툰_9슬롯_214X200
$weekPageId[6] = "03yj"; // 요일별_토요일_웹툰_9슬롯_214X200
$weekPageId[0] = "03yu"; // 요일별_일요일_웹툰_9슬롯_214X200

// 성인
$pageid18 = "042j"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "042u"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "0435"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "043G"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "043R"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "040o"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "040z"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "041A"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "041L"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "041W"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "041h"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "041s"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "03zJ"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "049L"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "03zU"; // 완결_하단배너_670X400
   } 

if ( $MD == "moodeung") {  // 무등일보

	$popstate='enable';
	$locationUrl="http://newspopcon.com/pop.asp?type=moodeung";

    $sCode = "05ev"; // 트래픽 체크
$pageid1 = "03wD"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "03wP"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "03wa"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "03wl"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "03ww"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "03xT"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "03yz"; // 요일별_하단배너_670X400

//해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
$weekPageId[2] = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
$weekPageId[3] = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
$weekPageId[4] = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
$weekPageId[5] = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
$weekPageId[6] = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
$weekPageId[0] = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200

// 성인
$pageid18 = "042c"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "042n"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "042y"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "0439"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "043K"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "040h"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "040s"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "0413"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "041E"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "041P"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "041a"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "041l"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "03zC"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "049E"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "03zN"; // 완결_하단배너_670X400
   } 

 if ( $MD == "newstown") {  // 뉴스타운

	$popstate='enable';
	$locationUrl="http://newspopcon.com/pop.asp?type=newstown";

    $sCode = "05ew"; // 트래픽 체크
$pageid1 = "04cR"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "04cV"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "04wT"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "04cd"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "04cZ"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "04ch"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "04cl"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "04wT"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "04wW"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "04wX"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "04wa"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "04wb"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "04we"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "04wf"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "04w8"; // 요일별_하단배너_670X400



// 성인
$pageid18 = "04vx"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "04vu"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "04w5"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "04w0"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "04w7"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "04wo"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "04wp"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "04wq"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "04wr"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "04ws"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "04wn"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "04wA"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "04wP"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "04wR"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "04w9"; // 완결_하단배너_670X400
   } 

  if ( $MD == "jemin") {  // 제민일보

	$popstate='enable';
	$locationUrl="http://newspopcon.com/pop.asp?type=jemin";

    $sCode = "05ex"; // 트래픽 체크
$pageid1 = "04cT"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "04cX"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "04wU"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "04cf"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "04cb"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "04cj"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "04cn"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "04wU"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "04wV"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "04wY"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "04wZ"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "04wc"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "04wd"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "04wg"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "04wB"; // 요일별_하단배너_670X400



// 성인
$pageid18 = "04vy"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "04vv"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "04w6"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "04vz"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "04wE"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "04wh"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "04wi"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "04wj"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "04wk"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "04wl"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "04wm"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "04wD"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "04wQ"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "04wS"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "04wC"; // 완결_하단배너_670X400
   } 

  if ( $MD == "hubnews") {  // 허브뉴스

	$popstate='enable';
	$locationUrl="http://newspopcon.com/pop.asp?type=hubnews";

    $sCode = "05j7"; // 트래픽 체크
$pageid1 = "03wF"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "03wR"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "03xk"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "03wc"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "03wn"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "03wy"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "03xV"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "03xk"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "03xv"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "03y6"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "03yH"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "03yS"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "03ye"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "03yp"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "03z1"; // 요일별_하단배너_670X400



// 성인
$pageid18 = "042d"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "042o"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "042z"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "043A"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "043L"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "040i"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "040t"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "0414"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "041F"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "041Q"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "041b"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "041m"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "03zE"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "049G"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "03zP"; // 완결_하단배너_670X400
   } 

   if ( $MD == "dispatch") {  // 디스패치

	$popstate='disable';


    $sCode = "05et"; // 트래픽 체크
$pageid1 = "051b"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "051c"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "051O"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "051f"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; //홈_배너_2_360X150
$pageid7 = "051e"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "051d"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "051g"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "051O"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "051P"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "051Q"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "051R"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "051S"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "051T"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "051U"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "051h"; // 요일별_하단배너_670X400



// 성인
$pageid18 = "051I"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "051H"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "051K"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "051J"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "051k"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "051V"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "051W"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "051X"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "051Y"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "051Z"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "051a"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "051j"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "051L"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "051M"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "051i"; // 완결_하단배너_670X400
   } 


    if ( $MD == "edaily") {  // 이데일리

	$popstate='disable';


    $sCode = "05Tm"; // 트래픽 체크
$pageid1 = "03wH"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "03wT"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "03xm"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "03we"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "03wp"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "03x0"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "03xX"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "03xm"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "03xx"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "03y8"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "03yJ"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "03yU"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "03yg"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "03yr"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "03z3"; // 요일별_하단배너_670X400



// 성인
$pageid18 = "042g"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "042r"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "0432"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "043D"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "043O"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "040l"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "040w"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "0417"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "041I"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "041T"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "041e"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "041p"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "03zG"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "049I"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "03zR"; // 완결_하단배너_670X400
   } 


     if ( $MD == "community") {  // 지니어스 커뮤니티

	$popstate='disable';
	$locationUrl="http://newspopcon.com/eco.asp?type=community";

    $sCode = "06ET"; // 트래픽 체크
$pageid1 = "04kR"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "04k4"; // 홈_상단 배너2_5슬롯_302X200
$pageid3 = "04la"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "04kp"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "04kg"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "04l7"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "04lL"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "04la"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "04lp"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "04lz"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "04m7"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "04mG"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "04ma"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "04mb"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "04mj"; // 요일별_하단배너_670X400



// 성인
$pageid18 = "04o9"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "04oH"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "04oP"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "04oX"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "04on"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "04nF"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "04nN"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "04nV"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "04nd"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "04nl"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "04nt"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "04o1"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "04mr"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "04mz"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "04n7"; // 완결_하단배너_670X400
   } 


    if ( $MD == "enewstoday") {  // 이뉴스투데이

	$popstate='disable';
	$locationUrl="http://newspopcon.com/eco.asp?type=enewstoday";

   $sCode = "06PP"; // 트래픽 체크
$pageid1 = "04kS"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "04k5"; // 홈_상단 배너2_5슬롯_302X200
$pageid3 = "04lc"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "04kq"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "04ki"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "04l9"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "04lN"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "04lc"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "04lq"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "04m0"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "04m8"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "04mI"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "04mZ"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "04mc"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "04mk"; // 요일별_하단배너_670X400



// 성인
$pageid18 = "04oA"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "04oI"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "04oQ"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "04oY"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "04oo"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "04nG"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "04nO"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "04nW"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "04ne"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "04nm"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "04nu"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "04o2"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "04ms"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "04n0"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "04n8"; // 완결_하단배너_670X400
   } 


     if ( $MD == "adpop") {  // 애드팝

	$popstate='enable';
	$locationUrl="http://newspopcon.com/eco.asp?type=adpop";

   $sCode = "04AZ"; // 트래픽 체크
$pageid1 = "04AM"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "04AN"; // 홈_상단 배너2_5슬롯_302X200
$pageid3 = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "04AS"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "04AR"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "04AT"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "04A2"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "04AB"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "04A7"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "04A6"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "04A5"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "04AA"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "04A9"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "04A0"; // 요일별_하단배너_670X400



// 성인
$pageid18 = "049v"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "049O"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "049P"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "049p"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "049x"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "04AF"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "04AJ"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "04AH"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "04AD"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "04AG"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "04AK"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "04A1"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "049N"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "049C"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "049z"; // 완결_하단배너_670X400
   } 


   if ( $MD == "genius") {  // 지니어스 언론사

	$popstate='disable';
	$locationUrl="http://newspopcon.com/eco.asp?type=genius";

   $sCode = "066L"; // 트래픽 체크
$pageid1 = "04N1"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "04NQ"; // 홈_상단 배너2_5슬롯_302X200
$pageid3 = "04Ow"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "04O0"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "04Nk"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "04OL"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "04Oe"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "04Ow"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "04PG"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "04Pc"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "04Pu"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "04Q5"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "04QJ"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "04Qf"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "04Sa"; // 요일별_하단배너_670X400



// 성인
$pageid18 = "04Qb"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "04RE"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "04Ru"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "04SY"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "04T1"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "04Qr"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "04RD"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "04RR"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "04Rh"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "04S1"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "04WL"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "04TB"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "04TR"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "04TY"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "04Ss"; // 완결_하단배너_670X400
   } 

if ( $MD == "topfeed") {  // 탑피드(지니)
    $sCode = "05Vr"; // 트래픽 체크
    $pageid1 = "04My"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NO"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04Ou"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04Ny"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; //홈_배너_2_360X150
    $pageid7 = "04Nh"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OI"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Oc"; // 홈_하단배너_3_670X400

// 요일별
    $pageid10 = "04Ou"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PD"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04PY"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Ps"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q3"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QH"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qd"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04SX"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04Ou"; // 요일별_월요일_웹툰_9슬롯_214X200adpop
    $weekPageId[2] = "04PD"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04PY"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Ps"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q3"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QH"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qd"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QK"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qx"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Rc"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SK"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Sm"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qp"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04R9"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RP"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Re"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04Rz"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SB"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04T9"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TP"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Te"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04Sp"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "hubpost") {  // 허브포스트(지니)
    $sCode = "05fP"; // 트래픽 체크
    $pageid1 = "04Mz"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NP"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04Ov"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04Nz"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04Nj"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OJ"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Od"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04Ov"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PF"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pa"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Pt"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q4"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QI"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qe"; // 요일별_일요일_웹툰_9슬롯_214X200
	$pageid17 = "04SZ"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04Ov"; // 요일별_월요일_웹툰_9슬롯_214X200adpop
    $weekPageId[2] = "04PF"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pa"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Pt"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q4"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QI"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qe"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QM"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qy"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Rg"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SL"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Sk"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qq"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RB"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RQ"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rf"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S0"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SC"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TA"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TQ"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04TX"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04Sq"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}



if ( $MD == "moneyW") {  // 머니위크(HNS)
    $sCode = "05er"; // 트래픽 체크
    $pageid1 = "03wC"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "03wO"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "03xh"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "03wZ"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; //홈_배너_2_360X150
    $pageid7 = "03wk"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "03wv"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "03xS"; // 홈_하단배너_3_670X400

// 요일별
    $pageid10 = "03xh"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "03xs"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "03y3"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "03yE"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "03yP"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "03yb"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "03ym"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "03yy"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "03xh"; // 요일별_월요일_웹툰_9슬롯_214X200adpop
    $weekPageId[2] = "03xs"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "03y3"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "03yE"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "03yP"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "03yb"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "03ym"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "042b"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "042m"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "042x"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "0438"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "043J"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "040g"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "040r"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "0412"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "041D"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "041O"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "041Z"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "041k"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "03zB"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "049D"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "03zM"; // 완결_하단배너_670X400
}






   

 if ( $MD == "bridgenews") {  // 브릿지경제(HNS)
    $sCode = "05es"; // 트래픽 체크
    $pageid1 = "03wE"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "03wQ"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "03xj"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "03wb"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "03wm"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "03wx"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "03xU"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "03xj"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "03xu"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "03y5"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "03yG"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "03yR"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "03yd"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "03yo"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "03z0"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "03xj"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "03xu"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "03y5"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "03yG"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "03yR"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "03yd"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "03yo"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "042d"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "042o"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "042z"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "043A"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "043L"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "040i"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "040t"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "0414"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "041F"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "041Q"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "041b"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "041m"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "03zD"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "049F"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "03zO"; // 완결_하단배너_670X400

    // back script
    $script = "back";
    $locationUrl="http://newspopcon.com/pop.asp?type=";





} else if ( $MD == "asia2day") {  // 아시아투데이(HNS)
    $sCode = "03N5"; // 트래픽 체크
    $pageid1 = "03wG"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "03wS"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "03xl"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "03wd"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "03wo"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "03wz"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "03xW"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "03xl"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "03xw"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "03y7"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "03yI"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "03yT"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "03yf"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "03yq"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "03z2"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "03xl"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "03xw"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "03y7"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "03yI"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "03yT"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "03yf"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "03yq"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "042d"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "042o"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "042z"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "043A"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "043L"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "040i"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "040t"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "0414"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "041F"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "041Q"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "041b"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "041m"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "03zF"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "049H"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "03zQ"; // 완결_하단배너_670X400







} else if ( $MD == "ajunews") {  // 아주경제(HNS)

$sCode = "03N6"; // 트래픽 체크
$pageid1 = "03wI"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "03wU"; // 홈_상단 배너2_5슬롯_302X200
$pageid3 = "03xn"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "03wf"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "03wq"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "03x1"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "03xY"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "03xn"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "03xy"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "03y9"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "03yK"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "03yV"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "03yh"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "03ys"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "03z4"; // 요일별_하단배너_670X400

//해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xn"; // 요일별_월요일_웹툰_9슬롯_214X200
$weekPageId[2] = "03xy"; // 요일별_화요일_웹툰_9슬롯_214X200
$weekPageId[3] = "03y9"; // 요일별_수요일_웹툰_9슬롯_214X200
$weekPageId[4] = "03yK"; // 요일별_목요일_웹툰_9슬롯_214X200
$weekPageId[5] = "03yV"; // 요일별_금요일_웹툰_9슬롯_214X200
$weekPageId[6] = "03yh"; // 요일별_토요일_웹툰_9슬롯_214X200
$weekPageId[0] = "03ys"; // 요일별_일요일_웹툰_9슬롯_214X200

// 성인
$pageid18 = "042h"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "042s"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "0433"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "043E"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "043P"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "040m"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "040x"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "0418"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "041J"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "041U"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "041f"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "041q"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "03zH"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "049J"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "03zS"; // 완결_하단배너_670X400



} else if ( $MD == "tvdaily") {  // 티브이데일리(HNS)
    $sCode = ""; // 트래픽 체크
    $pageid1 = "03wJ"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "03wV"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "03xo"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "03wg"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "03wr"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "03x2"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "03xZ"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "03xo"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "03xz"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "03yA"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "03yL"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "03yW"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "03yi"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "03yt"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "03z5"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "03xo"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "03xz"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "03yA"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "03yL"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "03yW"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "03yi"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "03yt"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "042i"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "042t"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "0434"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "043F"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "043Q"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "040n"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "040y"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "0419"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "041K"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "041V"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "041g"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "041r"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "03zI"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "049K"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "03zT"; // 완결_하단배너_670X400

    // back script
    $script = "back";
    $locationUrl="http://newspopcon.com/pop.asp?type=";


} else if ( $MD == "heraldpop") {  // 헤럴드팝(HNS)
    $sCode = "03qm"; // 트래픽 체크
$pageid1 = "03wL"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "03wX"; // 홈_상단 배너2_5슬롯_302X200
$pageid3 = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "03wi"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "03wt"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "03x4"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "03xb"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "03y1"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "03yC"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "03yN"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "03yO"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "03yk"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "03yv"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "03z7"; // 요일별_하단배너_670X400

//해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
$weekPageId[2] = "03y1"; // 요일별_화요일_웹툰_9슬롯_214X200
$weekPageId[3] = "03yC"; // 요일별_수요일_웹툰_9슬롯_214X200
$weekPageId[4] = "03yN"; // 요일별_목요일_웹툰_9슬롯_214X200
$weekPageId[5] = "03yO"; // 요일별_금요일_웹툰_9슬롯_214X200
$weekPageId[6] = "03yk"; // 요일별_토요일_웹툰_9슬롯_214X200
$weekPageId[0] = "03yv"; // 요일별_일요일_웹툰_9슬롯_214X200

// 성인
$pageid18 = "042k"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "042v"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "0436"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "043H"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "043S"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "040p"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "0410"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "041B"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "041M"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "041X"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "041i"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "041t"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "03zK"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "049M"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "03zV"; // 완결_하단배너_670X400


} 




if ( $MD == "stoo") {  // 스포츠투데이(HNS)
    $sCode = "04hT"; // 트래픽 체크
    $pageid1 = "04hz"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04i0"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04im"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04iI"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04iC"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04iQ"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04iY"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04im"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04iv"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04j8"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04jL"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04jS"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04jZ"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04rO"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04jl"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04im"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04iv"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04j8"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04jL"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04jS"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04jZ"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04rO"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04pQ"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04kf"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04pn"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04pq"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04qH"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04l2"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04lC"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04lU"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04lk"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04mN"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04ol"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04p4"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04k2"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04kI"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04kP"; // 완결_하단배너_670X400


}


if ( $MD == "econovill") {  // 이코노믹리뷰(HNS)
    $sCode = "04EF"; // 트래픽 체크
    $pageid1 = "04EB"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04Df"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04Dm"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04ED"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04EC"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04Dg"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04E7"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04Dm"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04Dp"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Dl"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Dk"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Dj"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04Do"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Dn"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04E5"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04Dm"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04Dp"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Dl"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Dk"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Dj"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04Do"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Dn"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04E8"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04De"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Dh"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04Di"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04E3"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Dr"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04Du"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04Dt"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Dq"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04Ds"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04Dv"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04E6"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04E9"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04EA"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04E4"; // 완결_하단배너_670X400

}

 


if ( $MD == "koreatimes") {  // 코리아타임즈(더에이_애니툰)
    $sCode = "04cN"; // 트래픽 체크
    $pageid1 = "04kZ"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04kB"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04ln"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04l0"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04ko"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04lI"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04lY"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04ln"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04ly"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04m6"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04mE"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04mR"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04mU"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04mi"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04mq"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04ln"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04ly"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04m6"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04mE"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04mR"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04mU"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04mi"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04oG"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04oO"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04oW"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04oi"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04ou"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04nM"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04nU"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04nc"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04nk"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04ns"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04o0"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04o7"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04my"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04n6"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04nE"; // 완결_하단배너_670X400

    // back script
    $script = "back";



}


if ( $MD == "etnews") {  // 전자신문(더에이_투믹스)
    $sCode = "059u"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "sstv") {  // sstv(더에이_투믹스)
    $sCode = "04Vj"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "munhwanews") {  // 문화뉴스(더에이_투믹스)
    $sCode = "04WG"; // 트래픽 체크
     $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "beatsports") {  // 비트스포츠(더에이_투믹스)
    $sCode = "04WH"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";



}



if ( $MD == "ggilbohot") {  // 금강(핫)(더에이_투믹스)
    $sCode = "04WA"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "ggilbo") {  // 금강일보(더에이_투믹스)
    $sCode = "04WB"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "ksilboenter") {  // 경상(연예)(더에이_투믹스)
    $sCode = "04W7"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "ksilbo") {  // 경상일보(더에이_투믹스)
    $sCode = "04W8"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "kihoilbohot") {  // 기호일보(핫)(더에이_투믹스)
    $sCode = "04WC"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "kihoilbo") {  // 기호일보(더에이_투믹스)
    $sCode = "04WD"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "polinews") {  // 폴리뉴스(더에이_투믹스)
    $sCode = "04WJ"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "polinewshot") {  // 폴리뉴스(핫)(더에이_투믹스)
    $sCode = "04Ye"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "liveen") {  // 라이브엔(더에이_투믹스)
    $sCode = "04WF"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}



if ( $MD == "cbcnews") {  // cbc뉴스(더에이_투믹스)
    $sCode = "04W4"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "dailygrid") {  // 데일리그리드(더에이_투믹스)
    $sCode = "04WE"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "upkorea") {  // 업코리아(더에이_투믹스)
    $sCode = "04WI"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "gooddailynews") {  // 굿데일리뉴스(더에이_투믹스)
    $sCode = "04W9"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "starjnhot") {  // 스타저널(핫)(더에이_투믹스)
    $sCode = "04Yf"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "kyungintoday") {  // 경인투데이(더에이_투믹스)
    $sCode = "04cF"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "econotalking") {  // 경제풍월(더에이_투믹스)
    $sCode = "04cG"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "datanet") {  // 데이터넷(더에이_투믹스)
    $sCode = "04cH"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "bithub") {  // 비트허브(더에이_투믹스)
    $sCode = "04cI"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "bithubhot") {  // 비트허브(핫)(더에이_투믹스)
    $sCode = "04cJ"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "worldtoday") {  // 월드투데이(더에이_투믹스)
    $sCode = "04cL"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "koreadaily") {  // 코리아데일리(더에이_투믹스)
    $sCode = "04cM"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}



if ( $MD == "kgdm") {  // 경기도민일보(더에이_투믹스)
    $sCode = "04cO"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "gnmaeil") {  // 경남매일(더에이_투믹스)
    $sCode = "04e5"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "newsquick") {  // 뉴스퀵(더에이_투믹스)
    $sCode = "04e6"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "ujnews") {  // 울산종합일보(더에이_투믹스)
    $sCode = "04e7"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "jnewsk") {  // 정읍신문(더에이_투믹스)
    $sCode = "04e8"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "gwnews") {  // 강원신문(더에이_투믹스)
    $sCode = "04e9"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "kcsnews") {  // 한국정경신문(더에이_투믹스)
    $sCode = "04eA"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "sportsdongajubunna") {  // 스포츠동아/주번나(더에이_투믹스)
    $sCode = "04hU"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "sportsseoulholic") {  // 스포츠서울/홀릭(더에이_투믹스)
    $sCode = "04hV"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "ispluscream") {  // 일간스포츠크림(더에이_투믹스)
    $sCode = "04hW"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

	if ( $MD == "betanews") {  // 베타뉴스(더에이_투믹스)
    $sCode = "059o"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "xportsnews") {  // 엑스포츠뉴스(더에이_투믹스)
    $sCode = "059p"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "joongdo") {  // 중도일보(더에이_투믹스)
    $sCode = "059q"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "channela") {  // 채널A(더에이_투믹스)
    $sCode = "059r"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "kmib") {  // 국민일보(더에이_투믹스)
    $sCode = "059s"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}

if ( $MD == "koreaherald") {  // 코리아헤럴드(더에이_투믹스)
    $sCode = "059t"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}


if ( $MD == "thefact") {  // 더팩트(더에이_투믹스)
    $sCode = "059v"; // 트래픽 체크
    $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04Se"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04Qu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04Si"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TF"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04T0"; // 완결_하단배너_670X400

    // back script
    $script = "back";


}



include_once "../common/type_tomix.php";



if($popstate==='enable'){
$popstate='disable';    
    if($view_type==='time'){
        if(!empty($post_link))
        foreach($post_link as $value){

            if($value['pln_start'] <= date('H') && $value['pln_end'] >= date('H') ){

                $popstate='enable';
                $locationUrl= $value['pln_url'];
                $link_id=$value['pln_id'];
                break;
            }            
        }
        
    } else {

        if(!empty($post_link)) {
        $popstate='enable';
            $rand = mt_rand(0,count($post_link)-1);
            $locationUrl= $post_link[$rand]['pln_url'];
            $link_id= $post_link[$rand]['pln_id'];
        }
    }
}

/*
$db_db = new DB_mysql('mysql:host=hiadone-m.cwvs02kjjoti.ap-northeast-2.rds.amazonaws.com;dbname=hiadone_ADM;charset=utf8', 'user_guest', 'guest///');
$query="SELECT `cb_board`.*
FROM `cb_board`
WHERE `cb_board`.`brd_key` = 'tomix'
";
$db_db->pquery($query);
$r = $db_db->fetchrow();

$query="SELECT `cb_post`.*
FROM `cb_post`
WHERE `cb_post`.`brd_id` = :brd_id
AND `post_del` <> 2
AND `post_md` = :post_md
ORDER BY `cb_post`.`post_id` desc";


$db_db->bindParam(':brd_id', $r['brd_id'], PDO::PARAM_INT);
$db_db->bindParam(':post_md', $MD, PDO::PARAM_STR);
$db_db->pquery($query);

if ($r = $db_db->fetchrow()) {


    $content_arr=explode("$",$r['post_content']);

    $media_code=array();
    foreach($content_arr as $value1){

        
        if(!empty($value1)){

        //echo content($value1)."<br>";
        $value2=explode("=",strip_tags($value1));
        
        //echo htmlspecialchars($value2[1],ENT_NOQUOTES)."<br>";
        $value3= explode(";",$value2[1]);

        $value3[0]= str_replace("\"","",$value3[0]);
        $value3[0]= str_replace("\'","",$value3[0]);

        
        $media_code[trim($value2[0])]= trim($value3[0]);
        //preg_match_all($pattern, $value3[0], $match);
        //$value3[0] = implode('', $match[0]);
        

      
        }
    }
    //print_r($media_code);
    $post_id=$r['post_id'];
    $extra_vars="";

    $query="SELECT `cb_post_extra_vars`.*
    FROM `cb_post_extra_vars`
    WHERE `cb_post_extra_vars`.`post_id` = :post_id";
    $db_db->bindParam(':post_id', $r['post_id'], PDO::PARAM_INT);
    $db_db->pquery($query);
    
    while($row = $db_db->fetchrow()){


        $extra_vars[$row['pev_key']] = $row['pev_value'];
    }


    $query="SELECT `cb_post_link`.*
    FROM `cb_post_link`
    WHERE `cb_post_link`.`post_id` = :post_id";
    $db_db->bindParam(':post_id', $r['post_id'], PDO::PARAM_INT);
    $db_db->pquery($query);
    
    while($row = $db_db->fetchrow()){


        $post_link[] = $row;
    }
} 
    

if(!empty($extra_vars)){
    $popstate='disable';
    if($extra_vars['popstate']==='enable'){

        if($extra_vars['view_type']==='time'){
            if(!empty($post_link))
            foreach($post_link as $value){

                if($value['pln_start'] <= date('H') && $value['pln_end'] >= date('H') ){

                    $popstate='enable';;
                    $media_code['popstate_url']= $value['pln_url'];
					$link_id=$value['pln_id'];
                    break;
                }            
            }
            
        } else {
            if(!empty($post_link)) {
		        $popstate='enable';;
                $rand = mt_rand(0,count($post_link)-1);
                $media_code['popstate_url']= $post_link[$rand]['pln_url'];
                $link_id= $post_link[$rand]['pln_id'];
            }
        }
    
    }
    //미디어 코드 재구성
        if(isset($media_code['sCode']))$sCode = $media_code['sCode'] ;// 트래픽 체크
        if(isset($media_code['pageid1']))$pageid1 = $media_code['pageid1'];   // 홈_상단_배너1_5슬롯_670X312
        

        if(isset($media_code['pageid2']))$pageid2 = $media_code['pageid2']; // 홈_상단 배너2_4슬롯_302X200
        if(isset($media_code['pageid3']))$pageid3 = $media_code['pageid3']; // 요일별_월요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid4']))$pageid4 = $media_code['pageid4']; // 홈_배너_1_360X150
        if(isset($media_code['pageid5']))$pageid5 = $media_code['pageid5']; // 홈_완결웹툰_6슬롯_328X200
        if(isset($media_code['pageid6']))$pageid6 = $media_code['pageid6']; // 홈_배너_2_360X150
        if(isset($media_code['pageid7']))$pageid7 = $media_code['pageid7']; // 홈_성인웹툰_6슬롯_328X200
        if(isset($media_code['pageid8']))$pageid8 = $media_code['pageid8']; // 홈_주간 베스트_4슬롯_302X200
        if(isset($media_code['pageid9']))$pageid9 = $media_code['pageid9']; // 홈_하단배너_3_670X400

        // 요일별
        if(isset($media_code['pageid10']))$pageid10 = $media_code['pageid10']; // 요일별_월요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid11']))$pageid11 = $media_code['pageid11']; // 요일별_화요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid12']))$pageid12 = $media_code['pageid12']; // 요일별_수요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid13']))$pageid13 = $media_code['pageid13']; // 요일별_목요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid14']))$pageid14 = $media_code['pageid14']; // 요일별_금요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid15']))$pageid15 = $media_code['pageid15']; // 요일별_토요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid16']))$pageid16 = $media_code['pageid16']; // 요일별_일요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid17']))$pageid17 = $media_code['pageid17']; // 요일별_하단배너_670X400


        // 성인
        if(isset($media_code['pageid18']))$pageid18 = $media_code['pageid18']; // 성인_투믹스 독점작_6슬롯_328X200
        if(isset($media_code['pageid19']))$pageid19 = $media_code['pageid19']; // PD 강력추천작_302X200
        if(isset($media_code['pageid20']))$pageid20 = $media_code['pageid20']; // 성인_배너_1_360X15
        if(isset($media_code['pageid21']))$pageid21 = $media_code['pageid21']; // 정주행 추천작_9슬롯_214X200
        if(isset($media_code['pageid22']))$pageid22 = $media_code['pageid22']; // 성인_배너_2_360X150
        if(isset($media_code['pageid23']))$pageid23 = $media_code['pageid23']; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        if(isset($media_code['pageid24']))$pageid24 = $media_code['pageid24']; // 성인_하단배너_670X400

        // 장르별
        if(isset($media_code['pageid25']))$pageid25 = $media_code['pageid25']; // 장르별_로맨스_웹툰_9슬롯_214X200
        if(isset($media_code['pageid26']))$pageid26 = $media_code['pageid26']; // 장르별_액션_웹툰_9슬롯_214X200
        if(isset($media_code['pageid27']))$pageid27 = $media_code['pageid27']; // 장르별_배너_1_360X150
        if(isset($media_code['pageid28']))$pageid28 = $media_code['pageid28']; // 장르별_스포츠_웹툰_9슬롯_214X200
        if(isset($media_code['pageid29']))$pageid29 = $media_code['pageid29']; // 장르별_드라마_웹툰_9슬롯_214X200
        if(isset($media_code['pageid30']))$pageid30 = $media_code['pageid30']; // 장르별_배너_2_360X150
        if(isset($media_code['pageid31']))$pageid31 = $media_code['pageid31']; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        if(isset($media_code['pageid32']))$pageid32 = $media_code['pageid32']; // 장르별_코믹_웹툰_9슬롯_214X200
        if(isset($media_code['pageid33']))$pageid33 = $media_code['pageid33']; // 장르별_하단배너_670X400

        // 주간 베스트
        if(isset($media_code['pageid34']))$pageid34 = $media_code['pageid34']; // 완결_완결웹툰_30슬롯_328X200
        if(isset($media_code['pageid35']))$pageid35 = $media_code['pageid35']; // 완결_배너_360X150
        if(isset($media_code['pageid36']))$pageid36 = $media_code['pageid36']; // 완결_완결웹툰_30슬롯2_328X200
        if(isset($media_code['pageid37']))$pageid37 = $media_code['pageid37']; // 완결_하단배너_670X400


        

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId="";
        if(isset($media_code['pageid10'])) $weekPageId[1] = $media_code['pageid10'];// 요일별_월요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid11'])) $weekPageId[2] =$media_code['pageid11'];// 요일별_화요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid12'])) $weekPageId[3] =$media_code['pageid12'];// 요일별_수요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid13'])) $weekPageId[4] =$media_code['pageid13'];// 요일별_목요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid14'])) $weekPageId[5] =$media_code['pageid14'];// 요일별_금요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid15'])) $weekPageId[6] =$media_code['pageid15'];// 요일별_토요일_웹툰_9슬롯_214X200
        if(isset($media_code['pageid16'])) $weekPageId[0] =$media_code['pageid16'];// 요일별_일요일_웹툰_9슬롯_214X200


    if(isset($media_code['popstate_url'])) $locationUrl= $media_code['popstate_url'] ;
    
}

$db_db->disconnect();
*/
//해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = $pageid10; // 요일별_월요일_웹툰_9슬롯_214X200
$weekPageId[2] = $pageid11; // 요일별_화요일_웹툰_9슬롯_214X200
$weekPageId[3] = $pageid12; // 요일별_수요일_웹툰_9슬롯_214X200
$weekPageId[4] = $pageid13; // 요일별_목요일_웹툰_9슬롯_214X200
$weekPageId[5] = $pageid14; // 요일별_금요일_웹툰_9슬롯_214X200
$weekPageId[6] = $pageid15; // 요일별_토요일_웹툰_9슬롯_214X200
$weekPageId[0] = $pageid16; // 요일별_일요일_웹툰_9슬롯_214X200

$pageId=[$sCode,$pageid1,$pageid2,$pageid3,$pageid4,$pageid5,$pageid6,$pageid7,$pageid8,$pageid9,$pageid10,$pageid11,$pageid12,$pageid13,$pageid14,$pageid15,$pageid16,$pageid17,$pageid18,$pageid19,$pageid20,$pageid21,$pageid22,$pageid23,$pageid24,$pageid25,$pageid26,$pageid27,$pageid28,$pageid29,$pageid30,$pageid31,$pageid32,$pageid33,$pageid34,$pageid35,$pageid36,$pageid37];