#!/usr/bin/php -q
<?php 
error_reporting(E_ALL);
ini_set("display_errors", 1);

/*

echo "createfile start";
?>
<script src="../js/jquery-1.11.1.min.js"></script>
<script>
var pelicanc="";
pelicanc=['01Ca','01Cb','042a','01Cc','02kX','0320','01Ci','02kY','027J','02u0','02u8'];
    


$(document).ready(function() {
    
    pelicanc.forEach(ShowResults);
    
});

function ShowResults(value, index) {

  //  if (index < 1) { return; }
    $.ajax({
        type: "GET", 
        async: true,
        data: "pageid="+value+"&lang=utf-8&out=json", 
        url: "http://ad.ad4989.co.kr/cgi-bin/pelicanc.dll?impr", 
        cache: false, 
        dataType: "jsonp", 
        jsonp: "jquerycallback", 
        success: function(data) 
        {
         
          createFile(data.tag,value+'.php');
         if(index <1) $("#"+value).html(data.tag); 

        },
        error: function(xhr, status, error) { ; } 
    });
}

function createFile(data,filename)
{

    $.ajax({
        type: "POST", 
        async: true,
        data : {data :data,filename :filename},
        url: "../createfile.php", 
        success: function(data) 
        {
        },
        error: function(xhr, status, error) { ; } 
    });
}
</script>
<?php 
echo "createfile end";
*/

function getPelicanc($MD){

    if ( $MD == "moneyW") {  // 머니위크
        $sCode = "03N0"; // 트래픽 체크
        $pageid1 = "03wC"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wO"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xh"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03x6"; // 홈_배너_1_360X150
        $pageid5 = "03wZ"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xH"; //홈_배너_2_360X150
        $pageid7 = "03wk"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03wv"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xS"; // 홈_하단배너_3_670X400

    // 요일별
        $pageid10 = "03xh"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03xs"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03y3"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yE"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yP"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yb"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03ym"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03yy"; // 요일별_하단배너_670X400

            //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xh"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03xs"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03y3"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yE"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yP"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yb"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03ym"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042b"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042m"; // PD 강력추천작_302X200
        $pageid20 = "048R"; // 성인_배너_1_360X15
        $pageid21 = "042x"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048d"; // 성인_배너_2_360X150
        $pageid23 = "0438"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043J"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040g"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040r"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "0483"; // 장르별_배너_1_360X150
        $pageid28 = "0412"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041D"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048F"; // 장르별_배너_2_360X150
        $pageid31 = "041O"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041Z"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041k"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zB"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047i"; // 완결_배너_360X150
        $pageid36 = "049D"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zM"; // 완결_하단배너_670X400


    }

    if ( $MD == "baobao") {  // 바오바오
        $sCode = "0549"; // 트래픽 체크
        $pageid1 = "051b"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "051c"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "051O"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "051l"; // 홈_배너_1_360X150
        $pageid5 = "051f"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "051m"; //홈_배너_2_360X150
        $pageid7 = "051e"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "051d"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "051g"; // 홈_하단배너_3_670X400

    // 요일별
        $pageid10 = "051O"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "051P"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "051Q"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "051R"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "051S"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "051T"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "051U"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "051h"; // 요일별_하단배너_670X400

            //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "051O"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "051P"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "051Q"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "051R"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "051S"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "051T"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "051U"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "051I"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "051H"; // PD 강력추천작_302X200
        $pageid20 = "051q"; // 성인_배너_1_360X15
        $pageid21 = "051K"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "051r"; // 성인_배너_2_360X150
        $pageid23 = "051J"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "051k"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "051V"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "051W"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "051o"; // 장르별_배너_1_360X150
        $pageid28 = "051X"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "051Y"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "051p"; // 장르별_배너_2_360X150
        $pageid31 = "051Z"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "051a"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "051j"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "051L"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "051n"; // 완결_배너_360X150
        $pageid36 = "051M"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "051i"; // 완결_하단배너_670X400

        // back script
        $script = "back";

    } else if ( $MD == "default") {  // 자사 하이애드원
        $sCode = "03Kq"; // 트래픽 체크
        $pageid1 = "03wK"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wW"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xp"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03xE"; // 홈_배너_1_360X150
        $pageid5 = "03wh"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xP"; // 홈_배너_2_360X150
        $pageid7 = "03ws"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03x3"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xa"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xp"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03y0"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03yB"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yM"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yX"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yj"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yu"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03z6"; // 요일별_하단배너_670X400

            //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xp"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03y0"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03yB"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yM"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yX"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yj"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yu"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042j"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042u"; // PD 강력추천작_302X200
        $pageid20 = "048Z"; // 성인_배너_1_360X15
        $pageid21 = "0435"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048l"; // 성인_배너_2_360X150
        $pageid23 = "043G"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043R"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040o"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040z"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "048B"; // 장르별_배너_1_360X150
        $pageid28 = "041A"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041L"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048N"; // 장르별_배너_2_360X150
        $pageid31 = "041W"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041h"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041s"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zJ"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047q"; // 완결_배너_360X150
        $pageid36 = "049L"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zU"; // 완결_하단배너_670X400

    } else if ( $MD == "moodeung") {  // 무등일보
        $sCode = "03N8"; // 트래픽 체크
        $pageid1 = "03wD"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wP"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03x7"; // 홈_배너_1_360X150
        $pageid5 = "03wa"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xI"; // 홈_배너_2_360X150
        $pageid7 = "03wl"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03ww"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xT"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03yz"; // 요일별_하단배너_670X400

            //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042c"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042n"; // PD 강력추천작_302X200
        $pageid20 = "048S"; // 성인_배너_1_360X15
        $pageid21 = "042y"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048e"; // 성인_배너_2_360X150
        $pageid23 = "0439"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043R"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040h"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040s"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "0484"; // 장르별_배너_1_360X150
        $pageid28 = "0413"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041E"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048G"; // 장르별_배너_2_360X150
        $pageid31 = "041P"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041a"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041l"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zC"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047j"; // 완결_배너_360X150
        $pageid36 = "049E"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zN"; // 완결_하단배너_670X400


    } else if ( $MD == "newstown") {  // 뉴스타운
        $sCode = "04YD"; // 트래픽 체크
        $pageid1 = "03wD"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wP"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03x7"; // 홈_배너_1_360X150
        $pageid5 = "03wa"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xI"; // 홈_배너_2_360X150
        $pageid7 = "03wl"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03ww"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xT"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03yz"; // 요일별_하단배너_670X400

            //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042c"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042n"; // PD 강력추천작_302X200
        $pageid20 = "048S"; // 성인_배너_1_360X15
        $pageid21 = "042y"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048e"; // 성인_배너_2_360X150
        $pageid23 = "0439"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043R"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040h"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040s"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "0484"; // 장르별_배너_1_360X150
        $pageid28 = "0413"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041E"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048G"; // 장르별_배너_2_360X150
        $pageid31 = "041P"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041a"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041l"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zC"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047j"; // 완결_배너_360X150
        $pageid36 = "049E"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zN"; // 완결_하단배너_670X400


    } else if ( $MD == "bridgenews") {  // 브릿지경제
        $sCode = "03N1"; // 트래픽 체크
        $pageid1 = "03wE"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wQ"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xj"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03x8"; // 홈_배너_1_360X150
        $pageid5 = "03wb"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xJ"; // 홈_배너_2_360X150
        $pageid7 = "03wm"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03wx"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xU"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xj"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03xu"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03y5"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yG"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yR"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yd"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yo"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03z0"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xj"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03xu"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03y5"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yG"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yR"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yd"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yo"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042d"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042o"; // PD 강력추천작_302X200
        $pageid20 = "048T"; // 성인_배너_1_360X15
        $pageid21 = "042z"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048f"; // 성인_배너_2_360X150
        $pageid23 = "043A"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043L"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040i"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040t"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "0485"; // 장르별_배너_1_360X150
        $pageid28 = "0414"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041F"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048H"; // 장르별_배너_2_360X150
        $pageid31 = "041Q"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041b"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041m"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zD"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047k"; // 완결_배너_360X150
        $pageid36 = "049F"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zO"; // 완결_하단배너_670X400



    } else if ( $MD == "sisunnews") {  // 시선뉴스
        $sCode = "03Pj"; // 트래픽 체크
        $pageid1 = "03wF"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wR"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xk"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03x9"; // 홈_배너_1_360X150
        $pageid5 = "03wc"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xK"; // 홈_배너_2_360X150
        $pageid7 = "03wn"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03wy"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xV"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xk"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03xv"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03y6"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yH"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yS"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03ye"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yp"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03z1"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xk"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03xv"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03y6"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yH"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yS"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03ye"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yp"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042d"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042o"; // PD 강력추천작_302X200
        $pageid20 = "048T"; // 성인_배너_1_360X15
        $pageid21 = "042z"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048f"; // 성인_배너_2_360X150
        $pageid23 = "043A"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043L"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040i"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040t"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "0485"; // 장르별_배너_1_360X150
        $pageid28 = "0414"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041F"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048H"; // 장르별_배너_2_360X150
        $pageid31 = "041Q"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041b"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041m"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zE"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047l"; // 완결_배너_360X150
        $pageid36 = "049G"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zP"; // 완결_하단배너_670X400



    } else if ( $MD == "asia2day") {  // 아시아투데이
        $sCode = "03N5"; // 트래픽 체크
        $pageid1 = "03wG"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wS"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xl"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03xA"; // 홈_배너_1_360X150
        $pageid5 = "03wd"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xL"; // 홈_배너_2_360X150
        $pageid7 = "03wo"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03wz"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xW"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xl"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03xw"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03y7"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yI"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yT"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yf"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yq"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03z2"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xl"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03xw"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03y7"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yI"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yT"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yf"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yq"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042d"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042o"; // PD 강력추천작_302X200
        $pageid20 = "048T"; // 성인_배너_1_360X15
        $pageid21 = "042z"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048f"; // 성인_배너_2_360X150
        $pageid23 = "043A"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043L"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040i"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040t"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "0485"; // 장르별_배너_1_360X150
        $pageid28 = "0414"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041F"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048H"; // 장르별_배너_2_360X150
        $pageid31 = "041Q"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041b"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041m"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zF"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047m"; // 완결_배너_360X150
        $pageid36 = "049H"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zQ"; // 완결_하단배너_670X400



    } else if( $MD == "asiae") {  // 아시아경제
        $sCode = "03N2"; // 트래픽 체크
        $pageid1 = "03wH"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wT"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xm"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03xB"; // 홈_배너_1_360X150
        $pageid5 = "03we"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xM"; // 홈_배너_2_360X150
        $pageid7 = "03wp"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03x0"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xX"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xm"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03xx"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03y8"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yJ"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yU"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yg"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yr"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03z3"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xm"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03xx"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03y8"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yJ"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yU"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yg"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yr"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042g"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042r"; // PD 강력추천작_302X200
        $pageid20 = "048W"; // 성인_배너_1_360X15
        $pageid21 = "0432"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048i"; // 성인_배너_2_360X150
        $pageid23 = "043D"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043O"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040l"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040w"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "0488"; // 장르별_배너_1_360X150
        $pageid28 = "0417"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041I"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048K"; // 장르별_배너_2_360X150
        $pageid31 = "041T"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041e"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041p"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zG"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047n"; // 완결_배너_360X150
        $pageid36 = "049I"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zR"; // 완결_하단배너_670X400



    } else if ( $MD == "ajunews") {  // 아주경제
        $sCode = "03N6"; // 트래픽 체크
        $pageid1 = "03wI"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xn"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03xC"; // 홈_배너_1_360X150
        $pageid5 = "03wf"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xN"; // 홈_배너_2_360X150
        $pageid7 = "03wq"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03x1"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xY"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xn"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03xy"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03y9"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yK"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yV"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yh"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03ys"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03z4"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xn"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03xy"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03y9"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yK"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yV"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yh"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03ys"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042h"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042s"; // PD 강력추천작_302X200
        $pageid20 = "048X"; // 성인_배너_1_360X15
        $pageid21 = "0433"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048j"; // 성인_배너_2_360X150
        $pageid23 = "043E"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043P"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040l"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040w"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "0488"; // 장르별_배너_1_360X150
        $pageid28 = "0417"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041I"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048K"; // 장르별_배너_2_360X150
        $pageid31 = "041T"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041e"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041p"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zH"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047o"; // 완결_배너_360X150
        $pageid36 = "049J"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zS"; // 완결_하단배너_670X400



    } else if ( $MD == "tvdaily") {  // 티브이데일리
        $sCode = "03N4"; // 트래픽 체크
        $pageid1 = "03wJ"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wV"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xo"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03xD"; // 홈_배너_1_360X150
        $pageid5 = "03wg"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xO"; // 홈_배너_2_360X150
        $pageid7 = "03wr"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03x2"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xZ"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xo"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03xz"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03yA"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yL"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yW"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yi"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yt"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03z5"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xo"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03xz"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03yA"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yL"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yW"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yi"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yt"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042i"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042t"; // PD 강력추천작_302X200
        $pageid20 = "048Y"; // 성인_배너_1_360X15
        $pageid21 = "0434"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048k"; // 성인_배너_2_360X150
        $pageid23 = "043F"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043Q"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040n"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "040y"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "048A"; // 장르별_배너_1_360X150
        $pageid28 = "0419"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041K"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048M"; // 장르별_배너_2_360X150
        $pageid31 = "041V"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041g"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041r"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zI"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047p"; // 완결_배너_360X150
        $pageid36 = "049K"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zT"; // 완결_하단배너_670X400


    } else if ( $MD == "heraldpop") {  // 헤럴드팝
        $sCode = "03qm"; // 트래픽 체크
        $pageid1 = "03wL"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wX"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03xF"; // 홈_배너_1_360X150
        $pageid5 = "03wi"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xQ"; // 홈_배너_2_360X150
        $pageid7 = "03wt"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03x4"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xb"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03y1"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03yC"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yN"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yO"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yk"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yv"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03z7"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03y1"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03yC"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yN"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yO"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yk"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yv"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042k"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042v"; // PD 강력추천작_302X200
        $pageid20 = "048a"; // 성인_배너_1_360X15
        $pageid21 = "0436"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048m"; // 성인_배너_2_360X150
        $pageid23 = "043H"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043S"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040p"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "0410"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "048C"; // 장르별_배너_1_360X150
        $pageid28 = "041B"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041M"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048O"; // 장르별_배너_2_360X150
        $pageid31 = "041X"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041i"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041t"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zK"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047r"; // 완결_배너_360X150
        $pageid36 = "049M"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zV"; // 완결_하단배너_670X400


    } 

    else if ( $MD == "jemin") {  // 제민일보
        $sCode = "04YE"; // 트래픽 체크
        $pageid1 = "03wL"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "03wX"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "03xF"; // 홈_배너_1_360X150
        $pageid5 = "03wi"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "03xQ"; // 홈_배너_2_360X150
        $pageid7 = "03wt"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "03x4"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "03xb"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "03y1"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "03yC"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "03yN"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "03yO"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "03yk"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "03yv"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "03z7"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "03y1"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "03yC"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "03yN"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "03yO"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "03yk"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "03yv"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "042k"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "042v"; // PD 강력추천작_302X200
        $pageid20 = "048a"; // 성인_배너_1_360X15
        $pageid21 = "0436"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048m"; // 성인_배너_2_360X150
        $pageid23 = "043H"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "043S"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "040p"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "0410"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "048C"; // 장르별_배너_1_360X150
        $pageid28 = "041B"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "041M"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048O"; // 장르별_배너_2_360X150
        $pageid31 = "041X"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "041i"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "041t"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "03zK"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047r"; // 완결_배너_360X150
        $pageid36 = "049M"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "03zV"; // 완결_하단배너_670X400


    } 

    if ( $MD == "sstv") {  // sstv
        $sCode = "04Vj"; // 트래픽 체크
        $pageid1 = "04Mq"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NH"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04On"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tf"; // 홈_배너_1_360X150
        $pageid5 = "04Nr"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Tr"; // 홈_배너_2_360X150
        $pageid7 = "04Na"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OD"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04OY"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04On"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04P6"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04PS"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Po"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q0"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QC"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04QW"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04SO"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04On"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04P6"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04PS"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Po"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q0"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QC"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04QW"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QO"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04R1"; // PD 강력추천작_302X200
        $pageid20 = "04Ud"; // 성인_배너_1_360X15
        $pageid21 = "04Ri"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Up"; // 성인_배너_2_360X150
        $pageid23 = "04SM"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04So"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Ql"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04R2"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UF"; // 장르별_배너_1_360X150
        $pageid28 = "04RL"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04RY"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04UR"; // 장르별_배너_2_360X150
        $pageid31 = "04Rv"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04S7"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04T5"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TH"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04U3"; // 완결_배너_360X150
        $pageid36 = "04TJ"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sh"; // 완결_하단배너_670X400

        // back script
        $script = "back";
    }


    if ( $MD == "munhwanews") {  // 문화뉴스
        $sCode = "04WG"; // 트래픽 체크
        $pageid1 = "04N7"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NT"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P3"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04To"; // 홈_배너_1_360X150
        $pageid5 = "04O4"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U0"; // 홈_배너_2_360X150
        $pageid7 = "04Nn"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OV"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Oi"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P3"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PL"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pi"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Px"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q8"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QP"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qi"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Sd"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P3"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PL"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pi"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Px"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q8"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QP"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qi"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QB"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qs"; // PD 강력추천작_302X200
        $pageid20 = "04Um"; // 성인_배너_1_360X15
        $pageid21 = "04RX"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uy"; // 성인_배너_2_360X150
        $pageid23 = "04SH"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Sg"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qw"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RI"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UO"; // 장르별_배너_1_360X150
        $pageid28 = "04RU"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Ro"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ua"; // 장르별_배너_2_360X150
        $pageid31 = "04S4"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SF"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TE"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TU"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04T3"; // 완결_배너_360X150
        $pageid36 = "04Tb"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sz"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "beatsports") {  // 비트스포츠
        $sCode = "04WH"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }



    if ( $MD == "ggilbohot") {  // 금강(핫)
        $sCode = "04WA"; // 트래픽 체크
        $pageid1 = "04My"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NO"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04Ou"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tj"; // 홈_배너_1_360X150
        $pageid5 = "04Ny"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Tv"; // 홈_배너_2_360X150
        $pageid7 = "04Nh"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OI"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Oc"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04Ou"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PD"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04PY"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Ps"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q3"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QH"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qd"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04SX"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04Ou"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PD"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04PY"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Ps"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q3"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QH"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qd"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QK"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qx"; // PD 강력추천작_302X200
        $pageid20 = "04Uh"; // 성인_배너_1_360X15
        $pageid21 = "04Rc"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Ut"; // 성인_배너_2_360X150
        $pageid23 = "04SK"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Sm"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qp"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04R9"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UJ"; // 장르별_배너_1_360X150
        $pageid28 = "04RP"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Re"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04UV"; // 장르별_배너_2_360X150
        $pageid31 = "04Rz"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SB"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04T9"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TP"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04U7"; // 완결_배너_360X150
        $pageid36 = "04Te"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sp"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

    if ( $MD == "mujehantv") {  // 무제한티비
        $sCode = "04xm"; // 트래픽 체크
        $pageid1 = "04My"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NO"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04Ou"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tj"; // 홈_배너_1_360X150
        $pageid5 = "04Ny"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Tv"; // 홈_배너_2_360X150
        $pageid7 = "04Nh"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OI"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Oc"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04Ou"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PD"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04PY"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Ps"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q3"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QH"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qd"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04SX"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04Ou"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PD"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04PY"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Ps"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q3"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QH"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qd"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QK"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qx"; // PD 강력추천작_302X200
        $pageid20 = "04Uh"; // 성인_배너_1_360X15
        $pageid21 = "04Rc"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Ut"; // 성인_배너_2_360X150
        $pageid23 = "04SK"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Sm"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qp"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04R9"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UJ"; // 장르별_배너_1_360X150
        $pageid28 = "04RP"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Re"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04UV"; // 장르별_배너_2_360X150
        $pageid31 = "04Rz"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SB"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04T9"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TP"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04U7"; // 완결_배너_360X150
        $pageid36 = "04Te"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sp"; // 완결_하단배너_670X400

        // back script
        $script = "back";


    }



    if ( $MD == "ggilbo") {  // 금강일보
        $sCode = "04WB"; // 트래픽 체크
        $pageid1 = "04Mz"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NP"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04Ov"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tk"; // 홈_배너_1_360X150
        $pageid5 = "04Nz"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Tw"; // 홈_배너_2_360X150
        $pageid7 = "04Nj"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OJ"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Od"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04Ov"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PF"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pa"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Pt"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q4"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QI"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qe"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04SZ"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04Ov"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PF"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pa"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Pt"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q4"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QI"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qe"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QM"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qy"; // PD 강력추천작_302X200
        $pageid20 = "04Ui"; // 성인_배너_1_360X15
        $pageid21 = "04Rg"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uu"; // 성인_배너_2_360X150
        $pageid23 = "04SL"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Sk"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qq"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RB"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UK"; // 장르별_배너_1_360X150
        $pageid28 = "04RQ"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rf"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04UW"; // 장르별_배너_2_360X150
        $pageid31 = "04S0"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SC"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TA"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TQ"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04U8"; // 완결_배너_360X150
        $pageid36 = "04TX"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sq"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "ksilboenter") {  // 경상(연예)
        $sCode = "04W7"; // 트래픽 체크
        $pageid1 = "04Mv"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NM"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04Os"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Th"; // 홈_배너_1_360X150
        $pageid5 = "04Nv"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Tt"; // 홈_배너_2_360X150
        $pageid7 = "04Nd"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OG"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Oa"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04Os"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04P9"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04PV"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Pq"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04WK"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QF"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qa"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04ST"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04Os"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04P9"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04PV"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Pq"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04WK"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QF"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qa"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QS"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04R6"; // PD 강력추천작_302X200
        $pageid20 = "04Uf"; // 성인_배너_1_360X15
        $pageid21 = "04Rl"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Ur"; // 성인_배너_2_360X150
        $pageid23 = "04SP"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Su"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qn"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04R5"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UH"; // 장르별_배너_1_360X150
        $pageid28 = "04RN"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rb"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04UT"; // 장르별_배너_2_360X150
        $pageid31 = "04Rx"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04S9"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04T7"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TL"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04U5"; // 완결_배너_360X150
        $pageid36 = "04TK"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sl"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "ksilbo") {  // 경상일보
        $sCode = "04W8"; // 트래픽 체크
        $pageid1 = "04Mx"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NN"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04Ot"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Ti"; // 홈_배너_1_360X150
        $pageid5 = "04Nx"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Tu"; // 홈_배너_2_360X150
        $pageid7 = "04Nf"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OH"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ob"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04Ot"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PA"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04PX"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Pr"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q2"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QG"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qc"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04SV"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04Ot"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PA"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04PX"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Pr"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q2"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QG"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qc"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QQ"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04R4"; // PD 강력추천작_302X200
        $pageid20 = "04Ug"; // 성인_배너_1_360X15
        $pageid21 = "04Rk"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Us"; // 성인_배너_2_360X150
        $pageid23 = "04SN"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Sr"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qo"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04R7"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UI"; // 장르별_배너_1_360X150
        $pageid28 = "04RO"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rd"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04UU"; // 장르별_배너_2_360X150
        $pageid31 = "04Ry"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SA"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04T8"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TO"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04U6"; // 완결_배너_360X150
        $pageid36 = "04TM"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sn"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

    if ( $MD == "kihoilbohot") {  // 기호일보(핫)
        $sCode = "04WC"; // 트래픽 체크
        $pageid1 = "04N1"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NQ"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04Ow"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tl"; // 홈_배너_1_360X150
        $pageid5 = "04O0"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Tx"; // 홈_배너_2_360X150
        $pageid7 = "04Nk"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OL"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Oe"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04Ow"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PG"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pc"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Pu"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q5"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QJ"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qf"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Sa"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04Ow"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PG"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pc"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Pu"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q5"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QJ"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qf"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04Qb"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04RE"; // PD 강력추천작_302X200
        $pageid20 = "04Uj"; // 성인_배너_1_360X15
        $pageid21 = "04Ru"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uv"; // 성인_배너_2_360X150
        $pageid23 = "04SY"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04T1"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qr"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RD"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UL"; // 장르별_배너_1_360X150
        $pageid28 = "04RR"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rh"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04UX"; // 장르별_배너_2_360X150
        $pageid31 = "04S1"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04WL"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TB"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TR"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04U9"; // 완결_배너_360X150
        $pageid36 = "04TY"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Ss"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

    if ( $MD == "kihoilbo") {  // 기호일보
        $sCode = "04WD"; // 트래픽 체크
        $pageid1 = "04N4"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NR"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04Oy"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tm"; // 홈_배너_1_360X150
        $pageid5 = "04O1"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Ty"; // 홈_배너_2_360X150
        $pageid7 = "04Nl"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OT"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Of"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04Oy"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PH"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pe"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Pv"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q6"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QL"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qg"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Sb"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04Oy"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PH"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pe"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Pv"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q6"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QL"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qg"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QZ"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04RG"; // PD 강력추천작_302X200
        $pageid20 = "04Uk"; // 성인_배너_1_360X15
        $pageid21 = "04Rt"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uw"; // 성인_배너_2_360X150
        $pageid23 = "04SW"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04T2"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qt"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RF"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UM"; // 장르별_배너_1_360X150
        $pageid28 = "04RS"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rj"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04UY"; // 장르별_배너_2_360X150
        $pageid31 = "04S2"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SD"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TC"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TS"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UA"; // 완결_배너_360X150
        $pageid36 = "04TZ"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04St"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "polinews") {  // 폴리뉴스
        $sCode = "04WJ"; // 트래픽 체크
        $pageid1 = "04N9"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NV"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P5"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tq"; // 홈_배너_1_360X150
        $pageid5 = "04O8"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U2"; // 홈_배너_2_360X150
        $pageid7 = "04Np"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OX"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ol"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P5"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PP"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pn"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Pz"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04QA"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QT"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qk"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Sf"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P5"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PP"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pn"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Pz"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04QA"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QT"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qk"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QU"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04R8"; // PD 강력추천작_302X200
        $pageid20 = "04Uo"; // 성인_배너_1_360X15
        $pageid21 = "04Rn"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04V0"; // 성인_배너_2_360X150
        $pageid23 = "04SR"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Sv"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04R0"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RK"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UQ"; // 장르별_배너_1_360X150
        $pageid28 = "04RW"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rs"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Uc"; // 장르별_배너_2_360X150
        $pageid31 = "04S6"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SI"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TG"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TW"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UE"; // 완결_배너_360X150
        $pageid36 = "04Td"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T4"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

    if ( $MD == "polinewshot") {  // 폴리뉴스(핫)
        $sCode = "04Ye"; // 트래픽 체크
        $pageid1 = "04N9"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NV"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04uD"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04vO"; // 홈_배너_1_360X150
        $pageid5 = "04O8"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04vP"; // 홈_배너_2_360X150
        $pageid7 = "04Np"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OX"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ol"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04uD"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04uE"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04uP"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04uV"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04uW"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04uh"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04un"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Sf"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04uD"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04uE"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04uP"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04uV"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04uW"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04uh"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04un"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QU"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04R8"; // PD 강력추천작_302X200
        $pageid20 = "04rz"; // 성인_배너_1_360X15
        $pageid21 = "04Rn"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04V0"; // 성인_배너_2_360X150
        $pageid23 = "04SR"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Sv"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04R0"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RK"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04t9"; // 장르별_배너_1_360X150
        $pageid28 = "04RW"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rs"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04tK"; // 장르별_배너_2_360X150
        $pageid31 = "04S6"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SI"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TG"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TW"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04sH"; // 완결_배너_360X150
        $pageid36 = "04Td"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T4"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

    if ( $MD == "liveen") {  // 라이브엔
        $sCode = "04WF"; // 트래픽 체크
        $pageid1 = "04N6"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NS"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P0"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tn"; // 홈_배너_1_360X150
        $pageid5 = "04O2"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Tz"; // 홈_배너_2_360X150
        $pageid7 = "04Nm"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OU"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Og"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P0"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PI"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pg"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Pw"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q7"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QN"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qh"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Sc"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P0"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PI"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pg"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Pw"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q7"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QN"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qh"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QV"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04RA"; // PD 강력추천작_302X200
        $pageid20 = "04Ul"; // 성인_배너_1_360X15
        $pageid21 = "04Rq"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Ux"; // 성인_배너_2_360X150
        $pageid23 = "04SS"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Sx"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qv"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RH"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UN"; // 장르별_배너_1_360X150
        $pageid28 = "04RT"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rm"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04UZ"; // 장르별_배너_2_360X150
        $pageid31 = "04S3"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SE"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TD"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TT"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UB"; // 완결_배너_360X150
        $pageid36 = "04Ta"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sw"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "cctvnews") {  // cctv뉴스
        $sCode = "04W5"; // 트래픽 체크
        $pageid1 = "04Mt"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NJ"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04Oq"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tg"; // 홈_배너_1_360X150
        $pageid5 = "04Nu"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Ts"; // 홈_배너_2_360X150
        $pageid7 = "04Nb"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OE"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04OZ"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04Oq"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04P7"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04PU"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Pp"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q1"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QD"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04QY"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04SQ"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04Oq"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04P7"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04PU"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Pp"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q1"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QD"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04QY"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QX"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04RC"; // PD 강력추천작_302X200
        $pageid20 = "04Ue"; // 성인_배너_1_360X15
        $pageid21 = "04Rr"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uq"; // 성인_배너_2_360X150
        $pageid23 = "04SU"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Sy"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qm"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04R3"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UG"; // 장르별_배너_1_360X150
        $pageid28 = "04RM"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04RZ"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04US"; // 장르별_배너_2_360X150
        $pageid31 = "04Rw"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04S8"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04T6"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04Vi"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04U4"; // 완결_배너_360X150
        $pageid36 = "04TI"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sj"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "cbcnews") {  // cbc뉴스
        $sCode = "04W4"; // 트래픽 체크
        $pageid1 = "04KO"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04Ke"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04LS"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Om"; // 홈_배너_1_360X150
        $pageid5 = "04L2"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04P2"; // 홈_배너_2_360X150
        $pageid7 = "04Kr"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04LA"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Mo"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04LS"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04Lb"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Lm"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Lp"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04M2"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04M3"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04MG"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04MN"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04LS"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04Lb"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Lm"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Lp"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04M2"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04M3"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04MG"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04Nq"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04O9"; // PD 강력추천작_302X200
        $pageid20 = "04Pf"; // 성인_배너_1_360X15
        $pageid21 = "04OA"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Ph"; // 성인_배너_2_360X150
        $pageid23 = "04OK"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04OP"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Mr"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04N5"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04PO"; // 장르별_배너_1_360X150
        $pageid28 = "04NA"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04NI"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04PQ"; // 장르별_배너_2_360X150
        $pageid31 = "04NK"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04NW"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04Nc"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04MZ"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04P8"; // 완결_배너_360X150
        $pageid36 = "04Mh"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Mk"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "dailygrid") {  // 데일리그리드
        $sCode = "04WE"; // 트래픽 체크
        $pageid1 = "04KQ"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04Kh"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04LW"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Oo"; // 홈_배너_1_360X150
        $pageid5 = "04L7"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Oz"; // 홈_배너_2_360X150
        $pageid7 = "04Kt"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04LD"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04LJ"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04LW"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04Ld"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Li"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Lu"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04M0"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04M5"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04MC"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04MP"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04LW"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04Ld"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Li"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Lu"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04M0"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04M5"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04MC"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04Nt"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04O6"; // PD 강력추천작_302X200
        $pageid20 = "04Pb"; // 성인_배너_1_360X15
        $pageid21 = "04OC"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Pl"; // 성인_배너_2_360X150
        $pageid23 = "04ON"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04OR"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Mu"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04N2"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04PK"; // 장르별_배너_1_360X150
        $pageid28 = "04NC"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04NF"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04PT"; // 장르별_배너_2_360X150
        $pageid31 = "04Oj"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04NY"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04Ng"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04Md"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04PC"; // 완결_배너_360X150
        $pageid36 = "04Mi"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Mm"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

    if ( $MD == "upkorea") {  // 업코리아
        $sCode = "04WI"; // 트래픽 체크
        $pageid1 = "04KS"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04Kj"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04LY"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Or"; // 홈_배너_1_360X150
        $pageid5 = "04L9"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Ox"; // 홈_배너_2_360X150
        $pageid7 = "04Kx"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04LF"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04LK"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04LY"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04Le"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Lg"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Lw"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Ly"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04M6"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04M7"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04MQ"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04LY"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04Le"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Lg"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Lw"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Ly"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04M6"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04M7"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04Nw"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04O3"; // PD 강력추천작_302X200
        $pageid20 = "04PZ"; // 성인_배너_1_360X15
        $pageid21 = "04OF"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Pm"; // 성인_배너_2_360X150
        $pageid23 = "04OO"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04OS"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Mw"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04N0"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04PJ"; // 장르별_배너_1_360X150
        $pageid28 = "04ND"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04NE"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04PW"; // 장르별_배너_2_360X150
        $pageid31 = "04Oh"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04NZ"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04Ni"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04Mf"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04PE"; // 완결_배너_360X150
        $pageid36 = "04Mj"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Mn"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "gooddailynews") {  // 굿데일리뉴스
        $sCode = "04W9"; // 트래픽 체크
        $pageid1 = "04KV"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04Kf"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04LU"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Op"; // 홈_배너_1_360X150
        $pageid5 = "04L4"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04P1"; // 홈_배너_2_360X150
        $pageid7 = "04Kv"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04LB"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04LI"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04LU"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04Lc"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Lk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Ls"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04M1"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04M4"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04ME"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04MO"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04LU"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04Lc"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Lk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Ls"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04M1"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04M4"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04ME"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04Ns"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04O7"; // PD 강력추천작_302X200
        $pageid20 = "04Pd"; // 성인_배너_1_360X15
        $pageid21 = "04OB"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Pj"; // 성인_배너_2_360X150
        $pageid23 = "04OM"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04OQ"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Ms"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04N3"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04PM"; // 장르별_배너_1_360X150
        $pageid28 = "04NB"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04NG"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04PR"; // 장르별_배너_2_360X150
        $pageid31 = "04NL"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04NX"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04Ne"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04Mb"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04PB"; // 완결_배너_360X150
        $pageid36 = "04Mp"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Ml"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

    if ( $MD == "econovill") {  // 이코노믹리뷰
        $sCode = "04EF"; // 트래픽 체크
        $pageid1 = "04EB"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04Df"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04Dm"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04E1"; // 홈_배너_1_360X150
        $pageid5 = "04ED"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04E2"; // 홈_배너_2_360X150
        $pageid7 = "04EC"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04Dg"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04E7"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04Dm"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04Dp"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Dl"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Dk"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Dj"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04Do"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Dn"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04E5"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04Dm"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04Dp"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Dl"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Dk"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Dj"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04Do"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Dn"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04E8"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04De"; // PD 강력추천작_302X200
        $pageid20 = "04Dw"; // 성인_배너_1_360X15
        $pageid21 = "04Dh"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Dx"; // 성인_배너_2_360X150
        $pageid23 = "04Di"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04E3"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Dr"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04Du"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04E0"; // 장르별_배너_1_360X150
        $pageid28 = "04Dt"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Dq"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04E0"; // 장르별_배너_2_360X150
        $pageid31 = "04Ds"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04Dv"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04E6"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04E9"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04Dy"; // 완결_배너_360X150
        $pageid36 = "04EA"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04E4"; // 완결_하단배너_670X400

    }


    if ( $MD == "starjnhot") {  // 스타저널(핫)
        $sCode = "04Yf"; // 트래픽 체크
        $pageid1 = "04Mv"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NM"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04uA"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04vL"; // 홈_배너_1_360X150
        $pageid5 = "04Nv"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04Tt"; // 홈_배너_2_360X150
        $pageid7 = "04Nd"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OG"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Oa"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04uA"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04uH"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04uM"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04uS"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04uZ"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04ue"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04uk"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04ST"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04uA"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04uH"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04uM"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04uS"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04uZ"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04ue"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04uk"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QS"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04R6"; // PD 강력추천작_302X200
        $pageid20 = "04s2"; // 성인_배너_1_360X15
        $pageid21 = "04Rl"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04s7"; // 성인_배너_2_360X150
        $pageid23 = "04SP"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Su"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qn"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04R5"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04tH"; // 장르별_배너_1_360X150
        $pageid28 = "04RN"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rb"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04tN"; // 장르별_배너_2_360X150
        $pageid31 = "04Rx"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04S9"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04T7"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TL"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04sK"; // 완결_배너_360X150
        $pageid36 = "04TK"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04Sl"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "kyungintoday") {  // 경인투데이
        $sCode = "04cF"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04dh"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04qT"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04qb"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04dh"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04di"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04dj"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04dk"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04dl"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04dm"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04dn"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04dh"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04di"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04dj"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04dk"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04dl"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04dm"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04dn"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04r8"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04rG"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04qs"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04r0"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04qk"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "econotalking") {  // 경제풍월
        $sCode = "04cG"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04if"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04qU"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04qc"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04if"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04io"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04j1"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04jD"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04jN"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04jU"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04jb"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04if"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04io"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04j1"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04jD"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04jN"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04jU"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04jb"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04r9"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04rH"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04qt"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04r1"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04ql"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "datanet") {  // 데이터넷
        $sCode = "04cH"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04ig"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04qV"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04qd"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04ig"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04ip"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04j2"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04jF"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04jO"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04jV"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04jc"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04ig"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04ip"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04j2"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04jF"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04jO"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04jV"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04jc"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04rA"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04rI"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04qu"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04r2"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04qm"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "bithub") {  // 비트허브
        $sCode = "04cI"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04ih"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04qW"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04qe"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04ih"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04ir"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04j4"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04jG"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04jP"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04jW"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04jd"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04ih"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04ir"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04j4"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04jG"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04jP"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04jW"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04jd"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04rB"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04r3"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04qv"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04qn"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "bithubhot") {  // 비트허브(핫)
        $sCode = "04cJ"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04ii"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04qX"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04qf"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04ii"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04it"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04j6"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04jH"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04jQ"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04jX"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04je"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04ii"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04it"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04j6"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04jH"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04jQ"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04jX"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04je"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04rC"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04rK"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04qw"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04r4"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04qo"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "itdaily") {  // 아이티데일리
        $sCode = "04cK"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04lg"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04p5"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04pF"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04lg"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04lu"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04m2"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04mA"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04mM"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04mX"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04me"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04lg"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04lu"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04m2"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04mA"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04mM"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04mX"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04me"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04qD"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04qO"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04pd"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04q0"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04pU"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "worldtoday") {  // 월드투데이
        $sCode = "04cL"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04li"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04p7"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04pG"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04li"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04lv"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04m3"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04mB"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04mO"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04mW"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04mf"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04li"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04lv"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04m3"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04mB"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04mO"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04mW"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04mf"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04qE"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04qP"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04pf"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04q1"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04pV"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "koreadaily") {  // 코리아데일리
        $sCode = "04cM"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04lm"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04p9"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04pK"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04lm"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04lx"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04m5"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04mD"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04mS"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04mT"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04mh"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04lm"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04lx"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04m5"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04mD"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04mS"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04mT"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04mh"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04qI"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04qR"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04pj"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04q4"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04pX"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "koreatimes") {  // 코리아타임즈
        $sCode = "04cN"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "kgdm") {  // 경기도민일보
        $sCode = "04cO"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "gnmaeil") {  // 경남매일
        $sCode = "04e5"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "newsquick") {  // 뉴스퀵
        $sCode = "04e6"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "ujnews") {  // 울산종합일보
        $sCode = "04e7"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "jnewsk") {  // 정읍신문
        $sCode = "04e8"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "gwnews") {  // 강원신문
        $sCode = "04e9"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "kcsnews") {  // 한국정경신문
        $sCode = "04eA"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

    if ( $MD == "sportsdongajubunna") {  // 스포츠동아/주번나
        $sCode = "04hU"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "sportsseoulholic") {  // 스포츠서울/홀릭
        $sCode = "04hV"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "stoozipper") {  // 스포츠투데이/지퍼
        $sCode = "04hT"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "ispluscream") {  // 일간스포츠크림
        $sCode = "04hW"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

        if ( $MD == "adpop") {  // 애드팝
        $sCode = "04AZ"; // 트래픽 체크
        $pageid1 = "04AM"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04AN"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "048o"; // 홈_배너_1_360X150
        $pageid5 = "04AS"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "048p"; // 홈_배너_2_360X150
        $pageid7 = "04AR"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04AT"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04A2"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04AB"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04A7"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04A6"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04A5"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04AA"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04A9"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04A0"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04AB"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04A7"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04A6"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04A5"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04AA"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04A9"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "049v"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "049O"; // PD 강력추천작_302X200
        $pageid20 = "048Q"; // 성인_배너_1_360X15
        $pageid21 = "049P"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "048c"; // 성인_배너_2_360X150
        $pageid23 = "049p"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "049x"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04AF"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04AJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "0482"; // 장르별_배너_1_360X150
        $pageid28 = "04AH"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04AD"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "048E"; // 장르별_배너_2_360X150
        $pageid31 = "04AG"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04AK"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04A1"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "049N"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "047h"; // 완결_배너_360X150
        $pageid36 = "049C"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "049z"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }


    if ( $MD == "betanews") {  // 베타뉴스
        $sCode = "059o"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";



    }

    if ( $MD == "xportsnews") {  // 엑스포츠뉴스
        $sCode = "059p"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";


    }


    if ( $MD == "joongdo") {  // 중도일보
        $sCode = "059q"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";


    }

    if ( $MD == "channela") {  // 채널A
        $sCode = "059r"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";


    }

    if ( $MD == "kmib") {  // 국민일보
        $sCode = "059s"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";


    }

    if ( $MD == "koreaherald") {  // 코리아헤럴드
        $sCode = "059t"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";


    }

    if ( $MD == "etnews") {  // 전자신문
        $sCode = "059u"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";


    }

    if ( $MD == "thefact") {  // 더팩트
        $sCode = "059v"; // 트래픽 체크
        $pageid1 = "04N8"; // 홈_상단_배너1_5슬롯_670X312
        $pageid2 = "04NU"; // 홈_상단 배너2_4슬롯_302X200
        $pageid3 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid4 = "04Tp"; // 홈_배너_1_360X150
        $pageid5 = "04O5"; // 홈_완결웹툰_6슬롯_328X200
        $pageid6 = "04U1"; // 홈_배너_2_360X150
        $pageid7 = "04No"; // 홈_성인웹툰_6슬롯_328X200
        $pageid8 = "04OW"; // 홈_주간 베스트_4슬롯_302X200
        $pageid9 = "04Ok"; // 홈_하단배너_3_670X400

        // 요일별
        $pageid10 = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $pageid11 = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $pageid12 = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $pageid13 = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $pageid14 = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $pageid15 = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $pageid16 = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200
        $pageid17 = "04Se"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
        $weekPageId[1] = "04P4"; // 요일별_월요일_웹툰_9슬롯_214X200
        $weekPageId[2] = "04PN"; // 요일별_화요일_웹툰_9슬롯_214X200
        $weekPageId[3] = "04Pk"; // 요일별_수요일_웹툰_9슬롯_214X200
        $weekPageId[4] = "04Py"; // 요일별_목요일_웹툰_9슬롯_214X200
        $weekPageId[5] = "04Q9"; // 요일별_금요일_웹툰_9슬롯_214X200
        $weekPageId[6] = "04QR"; // 요일별_토요일_웹툰_9슬롯_214X200
        $weekPageId[0] = "04Qj"; // 요일별_일요일_웹툰_9슬롯_214X200

        // 성인
        $pageid18 = "04QE"; // 성인_투믹스 독점작_6슬롯_328X200
        $pageid19 = "04Qu"; // PD 강력추천작_302X200
        $pageid20 = "04Un"; // 성인_배너_1_360X15
        $pageid21 = "04Ra"; // 정주행 추천작_9슬롯_214X200
        $pageid22 = "04Uz"; // 성인_배너_2_360X150
        $pageid23 = "04SJ"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
        $pageid24 = "04Si"; // 성인_하단배너_670X400

        // 장르별
        $pageid25 = "04Qz"; // 장르별_로맨스_웹툰_9슬롯_214X200
        $pageid26 = "04RJ"; // 장르별_액션_웹툰_9슬롯_214X200
        $pageid27 = "04UP"; // 장르별_배너_1_360X150
        $pageid28 = "04RV"; // 장르별_스포츠_웹툰_9슬롯_214X200
        $pageid29 = "04Rp"; // 장르별_드라마_웹툰_9슬롯_214X200
        $pageid30 = "04Ub"; // 장르별_배너_2_360X150
        $pageid31 = "04S5"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
        $pageid32 = "04SG"; // 장르별_코믹_웹툰_9슬롯_214X200
        $pageid33 = "04TF"; // 장르별_하단배너_670X400

        // 주간 베스트
        $pageid34 = "04TV"; // 완결_완결웹툰_30슬롯_328X200
        $pageid35 = "04UD"; // 완결_배너_360X150
        $pageid36 = "04Tc"; // 완결_완결웹툰_30슬롯2_328X200
        $pageid37 = "04T0"; // 완결_하단배너_670X400

        // back script
        $script = "back";


    }

    $pageId=[$pageid1,$pageid2,$pageid3,$pageid4,$pageid5,$pageid6,$pageid7,$pageid8,$pageid9,$pageid10,$pageid11,$pageid12,$pageid13,$pageid14,$pageid15,$pageid16,$pageid17,$pageid18,$pageid19,$pageid20,$pageid21,$pageid22,$pageid23,$pageid24,$pageid25,$pageid26,$pageid27,$pageid28,$pageid29,$pageid30,$pageid31,$pageid32,$pageid33,$pageid34,$pageid35,$pageid36,$pageid37,$weekPageId[date('w')]];
    //$pageId=[$pageid1,$pageid2,$pageid3,$pageid4,$pageid5,$pageid6,$pageid7,$pageid8,$pageid9,$weekPageId[date('w')]];
    return $pageId;
}


$md_code_arr=['moneyW','baobao','default','moodeung','newstown','bridgenews','sisunnews','asia2day','asiae','ajunews','tvdaily','heraldpop','jemin','sstv','munhwanews','beatsports','ggilbohot','mujehantv','ggilbo','ksilboenter','ksilbo','kihoilbohot','kihoilbo','polinews','polinewshot','liveen','cctvnews','cbcnews','dailygrid','upkorea','upkorea','gooddailynews','econovill','starjnhot','kyungintoday','econotalking','datanet','bithub','bithubhot','itdaily','worldtoday','koreadaily','koreatimes','kgdm','gnmaeil','newsquick','ujnews','jnewsk','gwnews','kcsnews','sportsdongajubunna','sportsseoulholic','stoozipper','ispluscream','adpop','betanews','xportsnews','joongdo','channela','kmib','koreaherald','etnews','thefact'];



$ctx = stream_context_create(array(   
       'http' => array(   
           'timeout' => 1 
           )   
       )   
    );   


foreach($md_code_arr as $val){


    $pelicanc=getPelicanc($val);


    


    foreach($pelicanc as $value){
        $content="";
        $html="";
        $fp2="";
        $content = file_get_contents('http://ad.ad4989.co.kr/cgi-bin/pelicanc.dll?impr&pageid='.$value.'&lang=utf-8&out=json',0,$ctx);

        if ($content !== false) {

            if(!is_dir(dirname(__FILE__)."/../boyoon/include/".$val)){ 
                umask(0); 
                if(!mkdir(dirname(__FILE__)."/../boyoon/include/".$val, 0777, true)){
                    print_r(error_get_last()); 
                    return; 
                } 

            }

          
            $filename=dirname(__FILE__).'/../boyoon/include/'.$val.'/foin_'.$value.'.php';
            echo $filename."<br>";
            $fp2= fopen($filename,"w");

            
            // $html = explode("\"tag\":",$content);        
            // $html[1]=rtrim($html[1],"})\"");
            // $html[1]=str_replace("\\r\\n","",$html[1]);

            $content= ltrim($content,"(");
            $content= rtrim($content,")");




          //$content =  iconv(mb_detect_encoding($content, mb_detect_order(), true), "UTF-8", $content);
            
             $html=json_decode($content,false);
             

    switch (json_last_error()) {
        case JSON_ERROR_NONE:
       // echo $html->tag;
            
            $html->tag = ltrim($html->tag,"\"");
            $html->tag = rtrim($html->tag,"\"");

            fwrite($fp2,$html->tag);
            fclose($fp2);
        break;
        case JSON_ERROR_DEPTH:
            echo ' - Maximum stack depth exceeded';
        break;
        case JSON_ERROR_STATE_MISMATCH:
            echo ' - Underflow or the modes mismatch';
        break;
        case JSON_ERROR_CTRL_CHAR:
            echo ' - Unexpected control character found';

            $content=stripcslashes($content);
            $tag=explode("\"tag\":\"",$content);
            $html= ltrim($tag[1],"\"");
            $html= rtrim($tag[1],"\"}");

            $html = ltrim($html,"\"");
            $html = rtrim($html,"\"");

            fwrite($fp2,$html);
            fclose($fp2);

        break;
        case JSON_ERROR_SYNTAX:
            echo ' - Syntax error, malformed JSON';
            $content=stripcslashes($content);
            $tag=explode("\"tag\":",$content);
            $html= ltrim($tag[1],"\"");
            $html= rtrim($tag[1],"\"}");

            $html = ltrim($html,"\"");
            $html = rtrim($html,"\"");
            fwrite($fp2,$html);
            fclose($fp2);
        break;
        case JSON_ERROR_UTF8:
            echo ' - Malformed UTF-8 characters, possibly incorrectly encoded';
        break;
        default:
            echo ' - Unknown error';
        break;
    }


            
        } else {
          echo ' error http://ad.ad4989.co.kr/cgi-bin/pelicanc.dll?impr&pageid='.$value.'&lang=utf-8&out=json<br>';
           
        }
    }

}


?>