<?php
if($MD=='ajunews'){
$sCode = "03N6"; // 트래픽 체크
 $pageid1 = "04KO"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04Ke"; // 홈_상단 배너2_4슬롯_302X200
 $pageid3 = "04LS"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04L2"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04Kr"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04LA"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04Mo"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04LS"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04Lb"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04Lm"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04Lp"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04M2"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04M3"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04MG"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04MN"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04LS"; // 요일별_월요일_웹툰_9슬롯_214X200adpop
 $weekPageId[2] = "04Lb"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04Lm"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04Lp"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04M2"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04M3"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04MG"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04Nq"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04O9"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04OA"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04OK"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04OP"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04Mr"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04N5"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04NA"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04NI"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04NK"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04NW"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04TA"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04MZ"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04Mh"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04Mk"; // 완결_하단배너_670X400
$post_id='73';
$popstate='disable';
$press_url='http://www.popapp.co.kr/anytoon/md.php?MD=ajunews';
$view_type='random';
}
if($MD=='re'){
$sCode = "05cg"; // 트래픽 체크
$pageid1 = "04hx"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04iK"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04in"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04iJ"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04iA"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04iR"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04ia"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04in"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04iw"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04jA"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04jM"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04jT"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04ja"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04jg"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04jn"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04in"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04iw"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04jA"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04jM"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04jT"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04ja"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04jg"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04pT"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04kh"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04po"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04pp"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04qJ"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04l3"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04lG"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04lW"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04lo"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04mQ"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04om"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04p6"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04k3"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04kJ"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04kQ"; // 완결_하단배너_670X400
$post_id='61';
$popstate='enable';
$press_url='http://www.popapp.co.kr/anytoon/md.php?MD=re';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=re';
$post_link[0]['pln_id']='49';
}
if($MD=='non'){
$sCode = "05cf"; // 트래픽 체크
$pageid1 = "04kV"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04k7"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04lg"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04kt"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04kk"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04lD"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04lQ"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04lg"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04lu"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04m2"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04mA"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04mM"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04mX"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04me"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04mm"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04lg"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04lu"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04m2"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04mA"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04mM"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04mX"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04me"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04oC"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04oK"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04oS"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04oa"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04oq"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04nI"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04nQ"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04nY"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04ng"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04no"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04nw"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04o4"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04mu"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04n2"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04nA"; // 완결_하단배너_670X400
$post_id='60';
$popstate='enable';
$press_url='http://www.popapp.co.kr/anytoon/md.php?MD=non';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=non';
$post_link[0]['pln_id']='48';
}
if($MD=='moneyWe'){
$sCode = "05er"; // 트래픽 체크
    $pageid1 = "04hw"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04i2"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04ii"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04iG"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04i9"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04iO"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04iV"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04ii"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04it"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04j6"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04jH"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04jQ"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04jX"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04je"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04jk"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04ii"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04it"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04j6"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04jH"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04jQ"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04jX"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04je"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04pN"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04kd"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04pl"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04ps"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04qC"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04ky"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04l8"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04lR"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04lh"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04mJ"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04oj"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04oz"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04jy"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04kG"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04kN"; // 완결_하단배너_670X400
$post_id='19';
$popstate='enable';
$press_url='http://www.popapp.co.kr/anytoon/md.php?MD=moneyWe';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/any.asp?type=moneyWe';
$post_link[0]['pln_id']='17';
}
if($MD=='bridgeany'){
$sCode = "05es"; // 트래픽 체크
    $pageid1 = "04KO"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04Ke"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04LS"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04L2"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04Kr"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04LA"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04Mo"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04LS"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04Lb"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04Lm"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04Lp"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04M2"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04M3"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04MG"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04MN"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04LS"; // 요일별_월요일_웹툰_9슬롯_214X200adpop
    $weekPageId[2] = "04Lb"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04Lm"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04Lp"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04M2"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04M3"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04MG"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04Nq"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04O9"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04OA"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04OK"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04OP"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04Mr"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04N5"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04NA"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04NI"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04NK"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04NW"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04TA"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04MZ"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04Mh"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04Mk"; // 완결_하단배너_670X400
$post_id='18';
$popstate='enable';
$press_url='http://www.popapp.co.kr/anytoon/md.php?MD=bridgeany';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=bridgeany';
$post_link[0]['pln_id']='16';
}
if($MD=='adpop'){
$sCode = "04AZ"; // 트래픽 체크
$pageid1 = "04AM"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "04AN"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "048o"; // 홈_배너_1_360X150
$pageid5 = "04AS"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "048p"; // 홈_배너_2_360X150
$pageid7 = "04AR"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "04AT"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "04A2"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "04AB"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "04A7"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "04A6"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "04A5"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "04AA"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "04A9"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "04A0"; // 요일별_하단배너_670X400

//해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
$weekPageId[2] = "04AB"; // 요일별_화요일_웹툰_9슬롯_214X200
$weekPageId[3] = "04A7"; // 요일별_수요일_웹툰_9슬롯_214X200
$weekPageId[4] = "04A6"; // 요일별_목요일_웹툰_9슬롯_214X200
$weekPageId[5] = "04A5"; // 요일별_금요일_웹툰_9슬롯_214X200
$weekPageId[6] = "04AA"; // 요일별_토요일_웹툰_9슬롯_214X200
$weekPageId[0] = "04A9"; // 요일별_일요일_웹툰_9슬롯_214X200

// 성인
$pageid18 = "049v"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "049O"; // PD 강력추천작_302X200
$pageid20 = "048Q"; // 성인_배너_1_360X15
$pageid21 = "049P"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048c"; // 성인_배너_2_360X150
$pageid23 = "049p"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "049x"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "04AF"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "04AJ"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "0482"; // 장르별_배너_1_360X150
$pageid28 = "04AH"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "04AD"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048E"; // 장르별_배너_2_360X150
$pageid31 = "04AG"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "04AK"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "04A1"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "049N"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047h"; // 완결_배너_360X150
$pageid36 = "049C"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "049z"; // 완결_하단배너_670X400
$post_id='12';
$popstate='enable';
$press_url='http://www.popapp.co.kr/anytoon/md.php?MD=adpop';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=adpop';
$post_link[0]['pln_id']='10';
}
?>
