<?php
if($MD=='default'){
$sCode = "03Kq"; // 트래픽 체크
$pageid1 = "03wB"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "03wM"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03x5"; // 홈_배너_1_360X150
$pageid5 = "03wY"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xG"; // 홈_배너_2_360X150
$pageid7 = "03wj"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "03wu"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "03xR"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "03xg"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "03xr"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "03y2"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "03yD"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "03yZ"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "03ya"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "03yl"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "03yx"; // 요일별_하단배너_670X400

//해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
$weekPageId[2] = "04AB"; // 요일별_화요일_웹툰_9슬롯_214X200
$weekPageId[3] = "04A7"; // 요일별_수요일_웹툰_9슬롯_214X200
$weekPageId[4] = "04A6"; // 요일별_목요일_웹툰_9슬롯_214X200
$weekPageId[5] = "04A5"; // 요일별_금요일_웹툰_9슬롯_214X200
$weekPageId[6] = "04AA"; // 요일별_토요일_웹툰_9슬롯_214X200
$weekPageId[0] = "04A9"; // 요일별_일요일_웹툰_9슬롯_214X200

// 성인
$pageid18 = "042a"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "042l"; // PD 강력추천작_302X200
$pageid20 = "048P"; // 성인_배너_1_360X15
$pageid21 = "042w"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048b"; // 성인_배너_2_360X150
$pageid23 = "0437"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "043I"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "040f"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "040q"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048P"; // 장르별_배너_1_360X150
$pageid28 = "0411"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "041C"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048b"; // 장르별_배너_2_360X150
$pageid31 = "041N"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "041Y"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "041j"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "03zA"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047g"; // 완결_배너_360X150
$pageid36 = "049B"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "03zL"; // 완결_하단배너_670X400
$post_id='11';
$popstate='disable';
$press_url='http://www.popapp.co.kr/?md=default';
$view_type='random';
}
?>
