<?php
if($MD=='mo_ca'){
$sCode = "073c"; // 트래픽 체크
$pageid1 = "03wE"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "03wQ"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "03xj"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "03wb"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "03wm"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "03wx"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "03xU"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "03xj"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "03xu"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "03y5"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "03yG"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "03yR"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "03yd"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "03yo"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "03z0"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xj"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "03xu"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "03y5"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "03yG"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "03yR"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "03yd"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "03yo"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "042d"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "042o"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "042z"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "043A"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "043L"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "040i"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "040t"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "0414"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "041F"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "041Q"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "041b"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "041m"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "03zD"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "049F"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "03zO"; // 완결_하단배너_670X400
$post_id='88';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=mo_ca';
$view_type='random';
}
if($MD=='mo_wi'){
$sCode = "073b"; // 트래픽 체크
$pageid1 = "03wC"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "03wO"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "03xh"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "03wZ"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "03wk"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "03wv"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "03xS"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "03xh"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "03xs"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "03y3"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "03yE"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "03yP"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "03yb"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "03ym"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "03yy"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xh"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "03xs"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "03y3"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "03yE"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "03yP"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "03yb"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "03ym"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "042b"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "042m"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "042x"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "0438"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "043J"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "040g"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "040r"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "0412"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "041D"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "041O"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "041Z"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "041k"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "03zB"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "049D"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "03zM"; // 완결_하단배너_670X400
$post_id='87';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=mo_wi';
$view_type='random';
}
if($MD=='moodeung'){
$sCode = "05ev"; // 트래픽 체크
$pageid1 = "03wD"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "03wP"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04ig"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "03wa"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "03wl"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "03ww"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "03xT"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "03yz"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "042c"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "042n"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "042y"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "0439"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "043K"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "040h"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "040s"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "0413"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "041E"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "041P"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "041a"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "041l"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "03zC"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "049E"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "03zN"; // 완결_하단배너_670X400
$post_id='80';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=moodeung';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=moodeung';
$post_link[0]['pln_id']='57';
}
if($MD=='jemin'){
$sCode = "05ex"; // 트래픽 체크
$pageid1 = "04cT"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04cX"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04ig"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04cf"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04cb"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04cj"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04cn"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04wU"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04wV"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04wY"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04wZ"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04wc"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04wd"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04wg"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04wB"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04wU"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04wV"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04wY"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04wZ"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04wc"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04wd"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04wg"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04vy"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04vv"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04w6"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04vz"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04wE"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04wh"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04wi"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04wj"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04wk"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04wl"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04wm"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04wD"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04wQ"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04wS"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04wC"; // 완결_하단배너_670X400
$post_id='79';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=jemin';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=jemin';
$post_link[0]['pln_id']='56';
}
if($MD=='newstown'){
$sCode = "05ew"; // 트래픽 체크
$pageid1 = "04cR"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04cV"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04ig"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04cd"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04cZ"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04ch"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04cl"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04wT"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04wW"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04wX"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04wa"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04wb"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04we"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04wf"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04w8"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04wT"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04wW"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04wX"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04wa"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04wb"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04we"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04wf"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04vx"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04vu"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04w5"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04w0"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04w7"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04wo"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04wp"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04wq"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04wr"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04ws"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04wn"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04wA"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04wP"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04wR"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04w9"; // 완결_하단배너_670X400
$post_id='78';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=newstown';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=newstown';
$post_link[0]['pln_id']='55';
}
if($MD=='bu_ca'){
$sCode = "06z2"; // 트래픽 체크
$pageid1 = "04hu"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04i4"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04ig"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04iE"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04i7"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04iM"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04iT"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04ig"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04ip"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04j2"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04jF"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04jO"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04jV"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04jc"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04ji"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04ig"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04ip"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04j2"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04jF"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04jO"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04jV"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04jc"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04pJ"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04kb"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04pg"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04pu"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04q8"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04ku"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04l5"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04lM"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04ld"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04mF"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04og"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04ox"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04ju"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04kE"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04kL"; // 완결_하단배너_670X400
$post_id='76';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=bu_ca';
$view_type='random';
}
if($MD=='bu_wi'){
$sCode = "06z1"; // 트래픽 체크
$pageid1 = "04uv"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04uz"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04u9"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04v7"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04v3"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04vB"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04vG"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04u9"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04uI"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04uL"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04uR"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04ua"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04ud"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04uj"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04up"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04u9"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04uI"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04uL"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04uR"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04ua"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04ud"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04uj"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04rh"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04rU"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04ru"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04rq"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04sD"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04sh"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04sn"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04t1"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04t4"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04st"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04tD"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04tR"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04sO"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04sX"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04sa"; // 완결_하단배너_670X400
$post_id='75';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=bu_wi';
$view_type='random';
}
if($MD=='community2'){
$sCode = "06mF"; // 트래픽 체크
$pageid1 = "04kR"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04k4"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04la"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04kp"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04kg"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04l7"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04lL"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04la"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04lp"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04lz"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04m7"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04mG"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04ma"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04mb"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04mj"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04la"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04lp"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04lz"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04m7"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04mG"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04ma"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04mb"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04o9"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04oH"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04oP"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04oX"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04on"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04nF"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04nN"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04nV"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04nd"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04nl"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04nt"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04o1"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04mr"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04mz"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04n7"; // 완결_하단배너_670X400
$post_id='71';
$popstate='enable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=community2';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=community2';
$post_link[0]['pln_id']='52';
}
if($MD=='moreadd'){
$sCode = "06kq"; // 트래픽 체크
$pageid1 = "04Mq"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04NH"; // 홈_상단 배너2_4슬롯_302X200
 $pageid3 = "04On"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04Nr"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04Na"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04OD"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04OY"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04On"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04P6"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04PS"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04Po"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04Q0"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04QC"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04QW"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04SO"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04On"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04P6"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04PS"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04Po"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04Q0"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04QC"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04QW"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04QO"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04R1"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04Ri"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04SM"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04So"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04Ql"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04R2"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04RL"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04RY"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04Rv"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04S7"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04T5"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04TH"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04TJ"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04Sh"; // 완결_하단배너_670X400
$post_id='70';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=moreadd';
$view_type='random';
}
if($MD=='heraldpop'){
$sCode = "03qm"; // 트래픽 체크
$pageid1 = "03wL"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "03wX"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "03wi"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "03wt"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "03x4"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "03xb"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "03y1"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "03yC"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "03yN"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "03yO"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "03yk"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "03yv"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "03z7"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xq"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "03y1"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "03yC"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "03yN"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "03yO"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "03yk"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "03yv"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "042k"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "042v"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "0436"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "043H"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "043S"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "040p"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "0410"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "041B"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "041M"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "041X"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "041i"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "041t"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "03zK"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "049M"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "03zV"; // 완결_하단배너_670X400
$post_id='68';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=heraldpop';
$view_type='';
}
if($MD=='ajunews'){
$sCode = "03N6"; // 트래픽 체크
$pageid1 = "03wI"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "03wU"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "03xn"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "03wf"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "03wq"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "03x1"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "03xY"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "03xn"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "03xy"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "03y9"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "03yK"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "03yV"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "03yh"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "03ys"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "03z4"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xn"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "03xy"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "03y9"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "03yK"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "03yV"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "03yh"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "03ys"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "042h"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "042s"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "0433"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "043E"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "043P"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "040m"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "040x"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "0418"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "041J"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "041U"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "041f"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "041q"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "03zH"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "049J"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "03zS"; // 완결_하단배너_670X400
$post_id='67';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=ajunews';
$view_type='';
}
if($MD=='genius'){
$sCode = "066L"; // 트래픽 체크
$pageid1 = "04N1"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04NQ"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04Ow"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04O0"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04Nk"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04OL"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04Oe"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04Ow"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04PG"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04Pc"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04Pu"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04Q5"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04QJ"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04Qf"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04Sa"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04Ow"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04PG"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04Pc"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04Pu"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04Q5"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04QJ"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04Qf"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04Qb"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04RE"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04Ru"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04SY"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04T1"; // 성인_하단배너_670X400

 // 장르별
 $pageid25 = "04Qr"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04RD"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04RR"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04Rh"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04S1"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04WL"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04TB"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04TR"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04TY"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04Ss"; // 완결_하단배너_670X400
$post_id='59';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=genius';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=genius';
$post_link[0]['pln_id']='47';
}
if($MD=='adpop'){
$sCode = "04AZ"; // 트래픽 체크
$pageid1 = "04AM"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04AN"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04AS"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04AR"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04AT"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04A2"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04AB"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04A7"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04A6"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04A5"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04AA"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04A9"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04A0"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04A8"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04AB"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04A7"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04A6"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04A5"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04AA"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04A9"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "049v"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "049O"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "049P"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "049p"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "049x"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04AF"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04AJ"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04AH"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04AD"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04AG"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04AK"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04A1"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "049N"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "049C"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "049z"; // 완결_하단배너_670X400
$post_id='56';
$popstate='enable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=adpop';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=adpop';
$post_link[0]['pln_id']='44';
}
if($MD=='tfnews'){
$sCode = "06pu"; // 트래픽 체크
$pageid1 = "04KV"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04Kf"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04LU"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04L4"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04Kv"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04LB"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04LI"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04LU"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04Lc"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04Lk"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04Ls"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04M1"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04M4"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04ME"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04MO"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04Oy"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04Lc"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04Lk"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04Ls"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04M1"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04M4"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04ME"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04Ns"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04O7"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04OB"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04OM"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04OQ"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04Ms"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04N3"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04NB"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04NG"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04NL"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04NX"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04Ne"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04Mb"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04Mp"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04Ml"; // 완결_하단배너_670X400
$post_id='54';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=tfnews';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=tfnews';
$post_link[0]['pln_id']='42';
}
if($MD=='community3'){
$sCode = "06nT"; // 트래픽 체크
$pageid1 = "04N4"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04NR"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04Oy"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04O1"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04Nl"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04OT"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04Of"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04Oy"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04PH"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04Pe"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04Pv"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04Q6"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04QL"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04Qg"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04Sb"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04Oy"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04PH"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04Pe"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04Pv"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04Q6"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04QL"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04Qg"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04QZ"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04RG"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04Rt"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04SW"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04T2"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04Qt"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04RF"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04RS"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04Rj"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04S2"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04SD"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04TC"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04TS"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04TZ"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04St"; // 완결_하단배너_670X400
$post_id='53';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=community3';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=community3';
$post_link[0]['pln_id']='41';
}
if($MD=='community1'){
$sCode = "06nS"; // 트래픽 체크
$pageid1 = "04ht"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04i5"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04if"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04iD"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04i6"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04iL"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04iS"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04if"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04io"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04j1"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04jD"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04jN"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04jU"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04jb"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04jh"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04if"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04io"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04j1"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04jD"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04jN"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04jU"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04jb"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04pH"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04ka"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04pe"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04pv"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04q6"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04ks"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04l4"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04lK"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04lb"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04lt"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04oe"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04ov"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04js"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04kD"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04kK"; // 완결_하단배너_670X400
$post_id='52';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=community1';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=community1';
$post_link[0]['pln_id']='40';
}
if($MD=='ymidea'){
$sCode = "06mD"; // 트래픽 체크
$pageid1 = "04dZ"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04da"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04dh"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04dc"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04db"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04dd"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04de"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04dh"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04di"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04dj"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04dk"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04dl"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04dm"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04dn"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04do"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04dh"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04di"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04dj"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04dk"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04dl"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04dm"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04dn"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04pE"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04kT"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04pc"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04pw"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04q3"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04dw"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04dx"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04lJ"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04lZ"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04lr"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04od"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04ov"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04ds"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04dt"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04dv"; // 완결_하단배너_670X400
$post_id='51';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=ymidea';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=ymidea';
$post_link[0]['pln_id']='39';
}
if($MD=='ymideaweb'){
$sCode = "06mE"; // 트래픽 체크
$pageid1 = "04Mx"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04NN"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04Ot"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04Nx"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04Nf"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04OH"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04Ob"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04Ot"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04PA"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04PX"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04Pr"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04Q2"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04QG"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04Qc"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04SV"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04Ot"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04PA"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04PX"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04Pr"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04Q2"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04QG"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04Qc"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04QQ"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04R4"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04Rk"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04SN"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04Sr"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04Qo"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04R7"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04RO"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04Rd"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04Ry"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04SA"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04T8"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04TO"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04TM"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04Sn"; // 완결_하단배너_670X400
$post_id='50';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=ymideaweb';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=6';
$post_link[0]['pln_id']='38';
}
if($MD=='topstarnews'){
$sCode = "06Yo"; // 트래픽 체크
$pageid1 = "04Mv"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04NM"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04Os"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04Nv"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04Nd"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04OG"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04Oa"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04Os"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04P9"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04PV"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04Pq"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04WK"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04QF"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04Qa"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04ST"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04Os"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04P9"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04PV"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04Pq"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04WK"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04QF"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04Qa"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04QS"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04R6"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04Rl"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04SP"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04Su"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04Qn"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04R5"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04RN"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04Rb"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04Rx"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04S9"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04T7"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04TL"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04TK"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04Sl"; // 완결_하단배너_670X400
$post_id='49';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=topstarnews';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=topstarnews';
$post_link[0]['pln_id']='37';
}
if($MD=='adcommunity'){
$sCode = "06kp"; // 트래픽 체크
$pageid1 = "04uu"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04uy"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04u8"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04v6"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04v2"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04vA"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04vH"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04u8"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04uJ"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04uK"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04uQ"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04ub"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04uc"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04ui"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04uo"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04u8"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04uJ"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04uK"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04uQ"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04ub"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04uc"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04ui"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04rg"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04rS"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04rt"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04rs"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04sC"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04sg"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04sm"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04t2"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04t3"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04ss"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04tE"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04tQ"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04tc"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04sY"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04sZ"; // 완결_하단배너_670X400
$post_id='48';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=adcommunity';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=4';
$post_link[0]['pln_id']='36';
}
if($MD=='enewstoday'){
$sCode = "06PP"; // 트래픽 체크
$pageid1 = "04kS"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04k5"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04lc"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04kq"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04ki"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04l9"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04lN"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04lc"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04lq"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04m0"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04m8"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04mI"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04mZ"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04mc"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04mk"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04lc"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04lq"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04m0"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04m8"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04mI"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04mZ"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04mc"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04oA"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04oI"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04oQ"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04oY"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04oo"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04nG"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04nO"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04nW"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04ne"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04nm"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04nu"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04o2"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04ms"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04n0"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04n8"; // 완결_하단배너_670X400
$post_id='47';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=enewstoday';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=enewstoday';
$post_link[0]['pln_id']='35';
}
if($MD=='community'){
$sCode = "06ET"; // 트래픽 체크
$pageid1 = "04kR"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04k4"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04la"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04kp"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04kg"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04l7"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04lL"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04la"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04lp"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04lz"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04m7"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04mG"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04ma"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04mb"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04mj"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04la"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04lp"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04lz"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04m7"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04mG"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04ma"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04mb"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04o9"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04oH"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04oP"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04oX"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04on"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04nF"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04nN"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04nV"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04nd"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04nl"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04nt"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04o1"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04mr"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04mz"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04n7"; // 완결_하단배너_670X400
$post_id='46';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=community';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=community';
$post_link[0]['pln_id']='34';
}
if($MD=='1'){
$sCode = ""; // 트래픽 체크
$pageid1 = "04Mq"; // 홈_상단_배너1_5슬롯_670X312
 $pageid2 = "04NH"; // 홈_상단 배너2_5슬롯_302X200
 $pageid3 = "04On"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid4 = "03xE"; // 홈_배너_1_360X150
 $pageid5 = "04Nr"; // 홈_완결웹툰_6슬롯_328X200
 $pageid6 = "03xP"; // 홈_배너_2_360X150
 $pageid7 = "04Na"; // 홈_성인웹툰_6슬롯_328X200
 $pageid8 = "04OD"; // 홈_주간 베스트_4슬롯_302X200
 $pageid9 = "04OY"; // 홈_하단배너_3_670X400

 // 요일별
$pageid10 = "04On"; // 요일별_월요일_웹툰_9슬롯_214X200
 $pageid11 = "04P6"; // 요일별_화요일_웹툰_9슬롯_214X200
 $pageid12 = "04PS"; // 요일별_수요일_웹툰_9슬롯_214X200
 $pageid13 = "04Po"; // 요일별_목요일_웹툰_9슬롯_214X200
 $pageid14 = "04Q0"; // 요일별_금요일_웹툰_9슬롯_214X200
 $pageid15 = "04QC"; // 요일별_토요일_웹툰_9슬롯_214X200
 $pageid16 = "04QW"; // 요일별_일요일_웹툰_9슬롯_214X200
 $pageid17 = "04SO"; // 요일별_하단배너_670X400

 //해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "04On"; // 요일별_월요일_웹툰_9슬롯_214X200
 $weekPageId[2] = "04P6"; // 요일별_화요일_웹툰_9슬롯_214X200
 $weekPageId[3] = "04PS"; // 요일별_수요일_웹툰_9슬롯_214X200
 $weekPageId[4] = "04Po"; // 요일별_목요일_웹툰_9슬롯_214X200
 $weekPageId[5] = "04Q0"; // 요일별_금요일_웹툰_9슬롯_214X200
 $weekPageId[6] = "04QC"; // 요일별_토요일_웹툰_9슬롯_214X200
 $weekPageId[0] = "04QW"; // 요일별_일요일_웹툰_9슬롯_214X200

 // 성인
$pageid18 = "04QO"; // 성인_투믹스 독점작_6슬롯_328X200
 $pageid19 = "04R1"; // PD 강력추천작_302X200
 $pageid20 = "048Z"; // 성인_배너_1_360X15
 $pageid21 = "04Ri"; // 정주행 추천작_9슬롯_214X200
 $pageid22 = "048l"; // 성인_배너_2_360X150
 $pageid23 = "04SM"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
 $pageid24 = "04So"; // 성인_하단배너_670X400

 // 장르별
$pageid25 = "04Ql"; // 장르별_로맨스_웹툰_9슬롯_214X200
 $pageid26 = "04R2"; // 장르별_액션_웹툰_9슬롯_214X200
 $pageid27 = "048B"; // 장르별_배너_1_360X150
 $pageid28 = "04RL"; // 장르별_스포츠_웹툰_9슬롯_214X200
 $pageid29 = "04RY"; // 장르별_드라마_웹툰_9슬롯_214X200
 $pageid30 = "048N"; // 장르별_배너_2_360X150
 $pageid31 = "04Rv"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
 $pageid32 = "04S7"; // 장르별_코믹_웹툰_9슬롯_214X200
 $pageid33 = "04T5"; // 장르별_하단배너_670X400

 // 주간 베스트
$pageid34 = "04TH"; // 완결_완결웹툰_30슬롯_328X200
 $pageid35 = "047q"; // 완결_배너_360X150
 $pageid36 = "04TJ"; // 완결_완결웹툰_30슬롯2_328X200
 $pageid37 = "04Sh"; // 완결_하단배너_670X400
$post_id='45';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=1';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/eco.asp?type=1';
$post_link[0]['pln_id']='33';
}
if($MD=='edaily'){
$sCode = "05Tm"; // 트래픽 체크
    $pageid1 = "03wH"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "03wT"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "03xm"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "03we"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "03wp"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "03x0"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "03xX"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "03xm"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "03xx"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "03y8"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "03yJ"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "03yU"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "03yg"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "03yr"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "03z3"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "03xm"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "03xx"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "03y8"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "03yJ"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "03yU"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "03yg"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "03yr"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "042g"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "042r"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "0432"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "043D"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "043O"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "040l"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "040w"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "0417"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "041I"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "041T"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "041e"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "041p"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "03zG"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "049I"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "03zR"; // 완결_하단배너_670X400
$post_id='26';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=edaily';
$view_type='random';
}
if($MD=='dispatch'){
$sCode = "05et"; // 트래픽 체크
    $pageid1 = "051b"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "051c"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "051O"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "051f"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; //홈_배너_2_360X150
    $pageid7 = "051e"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "051d"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "051g"; // 홈_하단배너_3_670X400

// 요일별
    $pageid10 = "051O"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "051P"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "051Q"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "051R"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "051S"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "051T"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "051U"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "051h"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "051O"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "051P"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "051Q"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "051R"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "051S"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "051T"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "051U"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "051I"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "051H"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "051K"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "051J"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "051k"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "051V"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "051W"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "051X"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "051Y"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "051Z"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "051a"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "051j"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "051L"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "051M"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "051i"; // 완결_하단배너_670X400
$post_id='25';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=dispatch';
$view_type='random';
}
if($MD=='hubnews'){
$sCode = "05j7"; // 트래픽 체크
    $pageid1 = "03wF"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "03wR"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "03xk"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "03wc"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "03wn"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "03wy"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "03xV"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "03xk"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "03xv"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "03y6"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "03yH"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "03yS"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "03ye"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "03yp"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "03z1"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "03xk"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "03xv"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "03y6"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "03yH"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "03yS"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "03ye"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "03yp"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "042d"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "042o"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "042z"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "043A"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "043L"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "040i"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "040t"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "0414"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "041F"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "041Q"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "041b"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "041m"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "03zE"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "049G"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "03zP"; // 완결_하단배너_670X400
$post_id='24';
$popstate='enable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=hubnews';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=hubnews';
$post_link[0]['pln_id']='20';
}
if($MD=='jemin'){
$sCode = "05ex"; // 트래픽 체크
    $pageid1 = "04cT"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04cX"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04wU"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04cf"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04cb"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04cj"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04cn"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04wU"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04wV"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04wY"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04wZ"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04wc"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04wd"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04wg"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04wB"; // 요일별_하단배너_670X400

    //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04wU"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04wV"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04wY"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04wZ"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04wc"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04wd"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04wg"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04vy"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04vv"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04w6"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04vz"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04wE"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04wh"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04wi"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04wj"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04wk"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04wl"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04wm"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04wD"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04wQ"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04wS"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04wC"; // 완결_하단배너_670X400
$post_id='17';
$popstate='enable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=jemin';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=jemin';
$post_link[0]['pln_id']='15';
}
if($MD=='newstown'){
$sCode = "05ew"; // 트래픽 체크
    $pageid1 = "04cR"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "04cV"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "04wT"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "04cd"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "04cZ"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "04ch"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "04cl"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "04wT"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "04wW"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "04wX"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "04wa"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "04wb"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "04we"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "04wf"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "04w8"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "04wT"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "04wW"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "04wX"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "04wa"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "04wb"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "04we"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "04wf"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "04vx"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "04vu"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "04w5"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "04w0"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "04w7"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "04wo"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "04wp"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "04wq"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "04wr"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "04ws"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "04wn"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "04wA"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "04wP"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "04wR"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "04w9"; // 완결_하단배너_670X400
$post_id='16';
$popstate='enable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=newstown';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=newstown';
$post_link[0]['pln_id']='14';
}
if($MD=='moodeung'){
$sCode = "05ev"; // 트래픽 체크
    $pageid1 = "03wD"; // 홈_상단_배너1_5슬롯_670X312
    $pageid2 = "03wP"; // 홈_상단 배너2_4슬롯_302X200
    $pageid3 = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid4 = "03xE"; // 홈_배너_1_360X150
    $pageid5 = "03wa"; // 홈_완결웹툰_6슬롯_328X200
    $pageid6 = "03xP"; // 홈_배너_2_360X150
    $pageid7 = "03wl"; // 홈_성인웹툰_6슬롯_328X200
    $pageid8 = "03ww"; // 홈_주간 베스트_4슬롯_302X200
    $pageid9 = "03xT"; // 홈_하단배너_3_670X400

    // 요일별
    $pageid10 = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
    $pageid11 = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
    $pageid12 = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
    $pageid13 = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
    $pageid14 = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
    $pageid15 = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
    $pageid16 = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200
    $pageid17 = "03yz"; // 요일별_하단배너_670X400

        //해당 요일에 대한 키값을 배열 변수에 저장
    $weekPageId[1] = "03xi"; // 요일별_월요일_웹툰_9슬롯_214X200
    $weekPageId[2] = "03xt"; // 요일별_화요일_웹툰_9슬롯_214X200
    $weekPageId[3] = "03y4"; // 요일별_수요일_웹툰_9슬롯_214X200
    $weekPageId[4] = "03yF"; // 요일별_목요일_웹툰_9슬롯_214X200
    $weekPageId[5] = "03yQ"; // 요일별_금요일_웹툰_9슬롯_214X200
    $weekPageId[6] = "03yc"; // 요일별_토요일_웹툰_9슬롯_214X200
    $weekPageId[0] = "03yn"; // 요일별_일요일_웹툰_9슬롯_214X200

    // 성인
    $pageid18 = "042c"; // 성인_투믹스 독점작_6슬롯_328X200
    $pageid19 = "042n"; // PD 강력추천작_302X200
    $pageid20 = "048Z"; // 성인_배너_1_360X15
    $pageid21 = "042y"; // 정주행 추천작_9슬롯_214X200
    $pageid22 = "048l"; // 성인_배너_2_360X150
    $pageid23 = "0439"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
    $pageid24 = "043K"; // 성인_하단배너_670X400

    // 장르별
    $pageid25 = "040h"; // 장르별_로맨스_웹툰_9슬롯_214X200
    $pageid26 = "040s"; // 장르별_액션_웹툰_9슬롯_214X200
    $pageid27 = "048B"; // 장르별_배너_1_360X150
    $pageid28 = "0413"; // 장르별_스포츠_웹툰_9슬롯_214X200
    $pageid29 = "041E"; // 장르별_드라마_웹툰_9슬롯_214X200
    $pageid30 = "048N"; // 장르별_배너_2_360X150
    $pageid31 = "041P"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
    $pageid32 = "041a"; // 장르별_코믹_웹툰_9슬롯_214X200
    $pageid33 = "041l"; // 장르별_하단배너_670X400

    // 주간 베스트
    $pageid34 = "03zC"; // 완결_완결웹툰_30슬롯_328X200
    $pageid35 = "047q"; // 완결_배너_360X150
    $pageid36 = "049E"; // 완결_완결웹툰_30슬롯2_328X200
    $pageid37 = "03zN"; // 완결_하단배너_670X400
$post_id='15';
$popstate='enable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=moodeung';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=moodeung';
$post_link[0]['pln_id']='13';
}
if($MD=='default'){
$sCode = "03Kq"; // 트래픽 체크
$pageid1 = "03wK"; // 홈_상단_배너1_5슬롯_670X312
$pageid2 = "03wW"; // 홈_상단 배너2_4슬롯_302X200
$pageid3 = "03xp"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid4 = "03xE"; // 홈_배너_1_360X150
$pageid5 = "03wh"; // 홈_완결웹툰_6슬롯_328X200
$pageid6 = "03xP"; // 홈_배너_2_360X150
$pageid7 = "03ws"; // 홈_성인웹툰_6슬롯_328X200
$pageid8 = "03x3"; // 홈_주간 베스트_4슬롯_302X200
$pageid9 = "03xa"; // 홈_하단배너_3_670X400

// 요일별
$pageid10 = "03xp"; // 요일별_월요일_웹툰_9슬롯_214X200
$pageid11 = "03y0"; // 요일별_화요일_웹툰_9슬롯_214X200
$pageid12 = "03yB"; // 요일별_수요일_웹툰_9슬롯_214X200
$pageid13 = "03yM"; // 요일별_목요일_웹툰_9슬롯_214X200
$pageid14 = "03yX"; // 요일별_금요일_웹툰_9슬롯_214X200
$pageid15 = "03yj"; // 요일별_토요일_웹툰_9슬롯_214X200
$pageid16 = "03yu"; // 요일별_일요일_웹툰_9슬롯_214X200
$pageid17 = "03z6"; // 요일별_하단배너_670X400

//해당 요일에 대한 키값을 배열 변수에 저장
$weekPageId[1] = "03xp"; // 요일별_월요일_웹툰_9슬롯_214X200
$weekPageId[2] = "03y0"; // 요일별_화요일_웹툰_9슬롯_214X200
$weekPageId[3] = "03yB"; // 요일별_수요일_웹툰_9슬롯_214X200
$weekPageId[4] = "03yM"; // 요일별_목요일_웹툰_9슬롯_214X200
$weekPageId[5] = "03yX"; // 요일별_금요일_웹툰_9슬롯_214X200
$weekPageId[6] = "03yj"; // 요일별_토요일_웹툰_9슬롯_214X200
$weekPageId[0] = "03yu"; // 요일별_일요일_웹툰_9슬롯_214X200

// 성인
$pageid18 = "042j"; // 성인_투믹스 독점작_6슬롯_328X200
$pageid19 = "042u"; // PD 강력추천작_302X200
$pageid20 = "048Z"; // 성인_배너_1_360X15
$pageid21 = "0435"; // 정주행 추천작_9슬롯_214X200
$pageid22 = "048l"; // 성인_배너_2_360X150
$pageid23 = "043G"; // 성인_당신의 판타지를 이뤄줄 그녀들_214X200
$pageid24 = "043R"; // 성인_하단배너_670X400

// 장르별
$pageid25 = "040o"; // 장르별_로맨스_웹툰_9슬롯_214X200
$pageid26 = "040z"; // 장르별_액션_웹툰_9슬롯_214X200
$pageid27 = "048B"; // 장르별_배너_1_360X150
$pageid28 = "041A"; // 장르별_스포츠_웹툰_9슬롯_214X200
$pageid29 = "041L"; // 장르별_드라마_웹툰_9슬롯_214X200
$pageid30 = "048N"; // 장르별_배너_2_360X150
$pageid31 = "041W"; // 장르별_무협/판타지_웹툰_9슬롯_214X200
$pageid32 = "041h"; // 장르별_코믹_웹툰_9슬롯_214X200
$pageid33 = "041s"; // 장르별_하단배너_670X400

// 주간 베스트
$pageid34 = "03zJ"; // 완결_완결웹툰_30슬롯_328X200
$pageid35 = "047q"; // 완결_배너_360X150
$pageid36 = "049L"; // 완결_완결웹툰_30슬롯2_328X200
$pageid37 = "03zU"; // 완결_하단배너_670X400
$post_id='13';
$popstate='disable';
$press_url='http://www.popapp.co.kr/tomix/md.php?MD=default';
$view_type='random';
$post_link[0]['pln_start']=0;
$post_link[0]['pln_end']=0;
$post_link[0]['pln_url']='http://newspopcon.com/pop.asp?type=jemin';
$post_link[0]['pln_id']='11';
}
?>
